{
    "data": [
        {
            "id": 130000001010030,
            "value": ""
        },
        {
            "id": 130000001012031,
            "value": "Immune to darkness and silence.\n \nUses many <color=#89D9FF>lightning-element physical attacks</color>. Grants self Lightning Resistance Up with <color=#FFFFD8>Greater Voltage</color>, which grows stronger as time passes. Uses <color=#FFFFD8>Pyramid</color> to incapacitate a single target."
        },
        {
            "id": 130000002001001,
            "value": "No immunities.\n \nHas high physical attack and attacks often."
        },
        {
            "id": 130000002001101,
            "value": "No immunities.\n \nHas high physical attack and attacks often. Inflicts DEF Down with <color=#FFFFD8>Breaking Whip</color>."
        },
        {
            "id": 130000002001201,
            "value": "Immune to poison.\n \nHas high physical attack and attacks often. Inflicts poison with <color=#FFFFD8>Virulent Bite</color>."
        },
        {
            "id": 130000002002001,
            "value": "No immunities.\n \nHas extremely low magic defense."
        },
        {
            "id": 130000002002101,
            "value": "No immunities.\n \nHas extremely low magic defense. Inflicts poison with <color=#FFFFD8>Poison Gas Grenade</color>."
        },
        {
            "id": 130000002002201,
            "value": "No immunities.\n \nHas extremely low magic defense. Grants all allies ATK Up and MATK Up with <color=#FFFFD8>Order to Attack</color>."
        },
        {
            "id": 130000002006001,
            "value": "No immunities.\n \nHas extremely high magic defense, but extremely low physical defense. Inflicts MDEF Down and unleashes a powerful ice-element magic attack with <color=#FFFFD8>Double Claw</color>."
        },
        {
            "id": 130000002008001,
            "value": "No immunities.\n \nAt the start of battle, grants self ATK Up with <color=#FFFFD8>Amp Up</color>."
        },
        {
            "id": 130000002008101,
            "value": "No immunities. \n \nAt the start of battle, grants self ATK Up with <color=#FFFFD8>Amp Up</color>. When allies are defeated, uses <color=#FFFFD8>Jump</color>, a powerful physical attack."
        },
        {
            "id": 130000002008102,
            "value": "No immunities. \n \nUses many <color=#89D9FF>physical attacks</color>. When allies are present, grants all allies ATK Up, DEF Up, and MDEF Up with <color=#FFFFD8>Declaration of War</color>. Frequently grants self ATK Up with <color=#FFFFD8>Amp Up</color>."
        },
        {
            "id": 130000002011001,
            "value": "Immune to silence and fog.\n \nCasts and inflicts <color=#FFFFD8>Fog</color>. When allies are defeated, uses <color=#FFFFD8>Concentration</color> to grant self greater ATK Up and MATK UP."
        },
        {
            "id": 130000002011002,
            "value": "Immune to silence and fog.\n \nUses <color=#89D9FF>ice-element magic attacks</color> and linked attacks with other SOLDIER: Third Class allies. Casts and inflicts <color=#FFFFD8>Fog</color>. When allies are defeated, uses <color=#FFFFD8>Concentration</color> to grant self greater ATK Up and MATK Up."
        },
        {
            "id": 130000002015001,
            "value": "No immunities.\n \nHas extremely high physical attack, low physical defense, and is <color=#89D9FF>extremely vulnerable to wind-element attacks</color>. Uses <color=#89D9FF>wind-element physical attacks</color>."
        },
        {
            "id": 130000002015005,
            "value": "No immunities.\n \nHas extremely high physical attack, but low physical defense and is <color=#89D9FF>extremely vulnerable to wind-element attacks</color>. Uses <color=#89D9FF>wind-element physical attacks</color>.\n \nWhen HP falls below a certain amount, uses <color=#FFFFD8>Blusterous Veil</color> to grant self Wind Potency Up and Physical Resistance."
        },
        {
            "id": 130000002015101,
            "value": "No immunities.\n \nHas extremely high physical attack, low physical defense, and is <color=#89D9FF>extremely vulnerable to ice-element attacks</color>. Uses <color=#89D9FF>fire-element physical attacks</color>."
        },
        {
            "id": 130000002015105,
            "value": "No immunities.\n \nHas extremely high physical attack, but low physical defense and is <color=#89D9FF>extremely vulnerable to ice-element attacks</color>. Uses <color=#89D9FF>fire-element physical attacks</color>.\n \nWhen HP falls below a certain amount, uses [<color=#FFFFD8>Fiery Veil</color> to grant self Fire Potency Up and Physical Resistance."
        },
        {
            "id": 130000002022001,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color> including the powerful fire-element attack <color=#FFFFD8>Fire Blast</color>."
        },
        {
            "id": 130000002022009,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color>. Inflicts DEF Down with <color=#FFFFD8>Devastating Chainguns</color>.\n \nWhen HP falls below a certain amount, uses <color=#FFFFD8>Shield Deployment</color>. If this action is interrupted, their physical defense is greatly lowered."
        },
        {
            "id": 130000002022101,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color> including the powerful <color=#FFFFD8>Matra Magic</color>."
        },
        {
            "id": 130000002022109,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color>. Inflicts poison with <color=#FFFFD8>Poison Blast</color>.\n \nWhen HP falls below a certain amount, uses <color=#FFFFD8>Shield Deployment</color>. Interrupting this action greatly lowers their physical defense."
        },
        {
            "id": 130000002022201,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color> including the powerful fire-element attack <color=#FFFFD8>Fire Blast</color>."
        },
        {
            "id": 130000002022209,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nHas extremely high physical defense, but extremely low magic defense. Uses many <color=#89D9FF>physical attacks</color> including <color=#FFFFD8>Fire Blast</color>, a powerful multi-target fire-element attack.\n \nWhen HP falls below a certain amount, uses <color=#FFFFD8>Shield Deployment</color>. If this action is interrupted, their physical defense is greatly lowered."
        },
        {
            "id": 130000002023001,
            "value": "No immunities.\n \nInflicts ATK Down with <color=#FFFFD8>Pacifying Shot</color>."
        },
        {
            "id": 130000002023101,
            "value": "No immunities.\n \nGrants self ATK Up with <color=#FFFFD8>stimulants</color>."
        },
        {
            "id": 130000002023201,
            "value": "No immunities.\n \nRestores HP of self and allies with <color=#FFFFD8>potions</color>."
        },
        {
            "id": 130000002024001,
            "value": "Immune to poison.\n \nHas extremely high magic defense, but extremely low physical defense. At the start of battle, uses the powerful fire-element magic attack <color=#FFFFD8>Flame Dance</color>."
        },
        {
            "id": 130000002024101,
            "value": "Immune to poison.\n \nHas extremely high magic defense, but extremely low physical defense. At the start of battle, uses the powerful water-element magic attack <color=#FFFFD8>Water Dance</color>."
        },
        {
            "id": 130000002024201,
            "value": "Immune to poison.\n \nHas extremely high magic defense, but extremely low physical defense. At the start of battle, uses the powerful lightning-element magic attack <color=#FFFFD8>Thunder Dance</color>."
        },
        {
            "id": 130000002025001,
            "value": "Immune to poison, darkness, silence, stun, fatigue, fog, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nUses <color=#FFFFD8>Flee</color> to escape from battle. If successful, no rewards will be obtained from them."
        },
        {
            "id": 130000002026001,
            "value": "Immune to stun.\n  \n<color=#89D9FF>Extremely vulnerable to ice-element attacks.</color> When HP falls below a certain amount, uses the powerful multi-target fire-element attack <color=#FFFFD8>Burst</color> and reduces own HP to 0."
        },
        {
            "id": 130000002027001,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color>"
        },
        {
            "id": 130000002027101,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color> Uses many <color=#89D9FF>water-element magic attacks</color>."
        },
        {
            "id": 130000002027201,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color> Uses <color=#89D9FF>earth-element physical attacks</color>. Inflicts fatigue with <color=#FFFFD8>Resin Bomb</color>. When allies are present, grants all allies MDEF Up with <color=#FFFFD8>Unearthly Rain</color>."
        },
        {
            "id": 130000002027205,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color> Uses <color=#89D9FF>earth-element physical attacks</color>. Inflicts fatigue with <color=#FFFFD8>Resin Bomb</color>.\n \nWhen allies are present, grants all allies MDEF Up with <color=#FFFFD8>Unearthly Rain</color>. When allies are defeated, uses <color=#FFFFD8>Queen's Lament</color>, which greatly increases physical and magic attack but lowers physical and magic defense."
        },
        {
            "id": 130000002027301,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color> Inflicts DEF Down on all enemies with <color=#FFFFD8>Intimidate</color>."
        },
        {
            "id": 130000002031001,
            "value": "No immunities.\n \nAfter a certain amount of time, grants self greater ATK Up with <color=#FFFFD8>Mutation</color>."
        },
        {
            "id": 130000002033001,
            "value": "Immune to poison.\n \nAfter a certain amount of time, grants self greater DEF Up with <color=#FFFFD8>Vulcanize</color> and inflicts poison with <color=#FFFFD8>Poison Sting</color>."
        },
        {
            "id": 130000002034001,
            "value": "Immune to poison, darkness, and fatigue.\n \nUses many <color=#89D9FF>physical attacks</color>. Inflicts poison with <color=#FFFFD8>Poison Sting</color>."
        },
        {
            "id": 130000002034004,
            "value": "Immune to poison, darkness, and fatigue.\n \nUses many <color=#89D9FF>physical attacks</color>. Inflicts poison with <color=#FFFFD8>Poison Sting</color>. Frequently inflicts fatigue and DEF Down with <color=#FFFFD8>Royal Webbing</color>. When HP falls below a certain amount, grants self greater DEF Up with <color=#FFFFD8>Vulcanize</color>."
        },
        {
            "id": 130000002501001,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nUses many <color=#89D9FF>fire-element physical attacks</color>. Also uses a variety of stream phase skills such as <color=#FFFFD8>Protection Wall</color> to lessen damage, and <color=#FFFFD8>Target Scanner</color> to focus attacks on a single target.\n \nUnleashes powerful counterattacks during <color=#FFFFD8>Counter Mode</color>."
        },
        {
            "id": 130000002501131,
            "value": "Immune to poison, darkness, silence, fatigue, and fog.\n \nUses many <color=#89D9FF>ice-element physical attacks</color>. Inflicts poison with <color=#FFFFD8>Poison Missiles</color>. Frequently grants self <color=#89D9FF>ATK Up</color>. Also uses <color=#FFFFD8>Mark 99 Launchers</color>, an extremely powerful multi-target attack that greatly lowers physical attack, physical defense, and magic defense after use."
        },
        {
            "id": 130000002501231,
            "value": "Immune to poison, darkness, silence, fatigue, fog, DEF Down, and MDEF Down.\n \nUses many <color=#89D9FF>lightning-element physical attacks</color>. Switches between <color=#FFFFD8>Water Wall</color>, making them resistant to water and weak to lightning, and <color=#FFFFD8>Thunder Wall</color>, making them resistant to lightning and weak to water."
        },
        {
            "id": 130000002502001,
            "value": "Immune to poison, darkness, silence, stun, fatigue, fog, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nUses many <color=#89D9FF>physical attacks</color> including the powerful multi-target attack <color=#FFFFD8>Big Bomber</color>. Inflicts DEF Down with <color=#FFFFD8>EM Field</color>."
        },
        {
            "id": 130000002502101,
            "value": "Immune to poison, darkness, silence, stun, fatigue, fog, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nUses many <color=#89D9FF>physical attacks</color> including the extremely powerful single-target attack <color=#FFFFD8>Tankbuster</color>. Tankbuster's potency is based on the time it takes to interrupt the preceding stream phase."
        },
        {
            "id": 130000002507131,
            "value": "Immune to darkness, silence, stun, and fog.\n \nHas high physical and magic defense, but is <color=#89D9FF>extremely vulnerable to fire-element attacks</color>. Uses many <color=#89D9FF>ice-element magic attacks</color> including the powerful <color=#FFFFD8>Blue Dragon Screech</color>. Focuses attacks on a single target during <color=#FFFFD8>On the Hunt</color>."
        },
        {
            "id": 130000002507201,
            "value": "Immune to darkness, silence, stun, and fog.\n \nHas high physical and magic defense, but is <color=#89D9FF>extremely vulnerable to ice-element attacks</color>. Uses many <color=#89D9FF>fire-element magic attacks</color> including the powerful <color=#FFFFD8>Red Dragon Screech</color>. Focuses attacks on a single target during <color=#FFFFD8>On the Hunt</color>."
        },
        {
            "id": 130000002510001,
            "value": "Immune to darkness, silence, stun, fatigue, fog, ATK Down, and MATK Down.\n \nUses many <color=#89D9FF>fire-element attacks</color> including the powerful multi-target attack <color=#FFFFD8>Hellfire</color>."
        },
        {
            "id": 130000002510002,
            "value": "Immune to darkness, silence, stun, fatigue, fog, ATK Down, and MATK Down.\n\nSince it frequently uses<color=#89D9FF>fire-element attacks</color>, <color=#89D9FF>Fire Resistance Up</color> is effective.\nForce Gauge: <color=#FFFFD8>Ignition</color> can only be depleted with <color=#89D9FF>ice-element attacks</color>. \nDestroying sigils quickly during <color=#FFFFD8>Incinerate</color> lowers the potency of <color=#FFFFD8>Hellfire</color>."
        },
        {
            "id": 130000002513001,
            "value": "Immune to darkness, stun, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nHas extremely high physical attack and uses many <color=#89D9FF>physical attacks</color>. Unleashes a powerful linked attack with Vajradhara Tai, but afterward becomes incapacitated with greatly lowered physical defense."
        },
        {
            "id": 130000002513101,
            "value": "Immune to darkness, stun, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nHas extremely low physical and magic defense and uses many <color=#89D9FF>physical attacks</color>. Unleashes a powerful linked attack with Vajradhara Lin, and afterward grants self <color=#89D9FF>Physical Resistance or Magic Resistance</color>."
        },
        {
            "id": 130000002514001,
            "value": "Immune to darkness, stun, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nHas extremely high physical attack and uses many <color=#89D9FF>physical attacks</color>. Unleashes a powerful linked attack with Vajradhara Wu, but afterward becomes incapacitated with greatly lowered physical defense."
        },
        {
            "id": 130000002514101,
            "value": "Immune to darkness, stun, ATK Down, DEF Down, MATK Down, and MDEF Down.\n \nHas extremely low physical and magic defense and uses many <color=#89D9FF>physical attacks</color>. Unleashes a powerful linked attack with Vajradhara Tamb, and afterward grants self <color=#89D9FF>Physical Resistance or Magic Resistance</color>."
        },
        {
            "id": 130000002517001,
            "value": "No immunities.\n \n<color=#89D9FF>Extremely vulnerable to earth-element attacks.</color> Uses <color=#89D9FF>water-element magic attacks</color> including the powerful multi-target attack <color=#FFFFD8>Water Surge</color>.\n \nCalls additional allies to battle, and becomes aggressive when allies are defeated. Uses many powerful abilities to support allies, such as <color=#FFFFD8>Spur</color>, which grants ATK Up and MATK Up."
        },
        {
            "id": 130000002521001,
            "value": "Immune to poison, darkness, silence, stun, fatigue, and fog, DEF Down, and MDEF Down.\n \nHas high physical defense and uses many <color=#89D9FF>physical attacks</color>. Frequently grants self ATK Up with <color=#FFFFD8>Furious Tantrum</color>. Counters with magic attacks during <color=#FFFFD8>Alert</color>."
        }
    ]
}