{
    "data": [
        {
            "id": 901000000010001,
            "value": "Cloud Strife"
        },
        {
            "id": 901000000010002,
            "value": "Barret Wallace"
        },
        {
            "id": 901000000010003,
            "value": "Tifa Lockhart"
        },
        {
            "id": 901000000010004,
            "value": "Aerith Gainsborough"
        },
        {
            "id": 901000000010005,
            "value": "Red XIII"
        },
        {
            "id": 901000000010012,
            "value": "Reno"
        },
        {
            "id": 901000000010016,
            "value": "Biggs"
        },
        {
            "id": 901000000010017,
            "value": "Jessie"
        },
        {
            "id": 901000000010018,
            "value": "Wedge"
        },
        {
            "id": 901000000010020,
            "value": "Zack Fair"
        },
        {
            "id": 901000000010048,
            "value": "Angeal Hewley"
        },
        {
            "id": 901000000010203,
            "value": "Lazard"
        },
        {
            "id": 901000000010204,
            "value": "Genesis Rhapsodos"
        },
        {
            "id": 901000000011001,
            "value": "Midgar"
        },
        {
            "id": 901000000011002,
            "value": "7th Heaven"
        },
        {
            "id": 901000000011003,
            "value": "Fort Tamblin"
        },
        {
            "id": 901000000011004,
            "value": "The Church"
        },
        {
            "id": 901000000011005,
            "value": "The Arena"
        },
        {
            "id": 901000000011006,
            "value": "The Training Room"
        },
        {
            "id": 901000000011007,
            "value": "The SOLDIER Area"
        },
        {
            "id": 901000000012001,
            "value": "Shinra Electric Power Company"
        },
        {
            "id": 901000000012002,
            "value": "Mako Reactors"
        },
        {
            "id": 901000000012003,
            "value": "Loveless"
        },
        {
            "id": 901000000012004,
            "value": "Chocobo Farm"
        },
        {
            "id": 901000000012005,
            "value": "Trains"
        },
        {
            "id": 901000000020001,
            "value": "Support Materia"
        },
        {
            "id": 901000000020002,
            "value": "Synthesis Recipes"
        },
        {
            "id": 901000000020003,
            "value": "Upgrading Materia"
        },
        {
            "id": 901000000020004,
            "value": "Increasing Weapon Rarity"
        },
        {
            "id": 901000000020005,
            "value": "The Armory"
        },
        {
            "id": 901000000020006,
            "value": "Converting Weapon Parts"
        },
        {
            "id": 901000000020007,
            "value": "Statstreams"
        },
        {
            "id": 901000000020008,
            "value": "Limit Breaks"
        },
        {
            "id": 901000000020009,
            "value": "Summon Abilities"
        },
        {
            "id": 901000000020010,
            "value": "Battle Gear"
        },
        {
            "id": 901000000020011,
            "value": "Story Party Mode"
        },
        {
            "id": 901000000020012,
            "value": "Story Quest EXP"
        },
        {
            "id": 901000000020013,
            "value": "Free Party Mode"
        },
        {
            "id": 901000000020014,
            "value": "Support Abilities"
        },
        {
            "id": 901000000021001,
            "value": "Multi Battles"
        },
        {
            "id": 901000000021002,
            "value": "Command Shift"
        },
        {
            "id": 901000000021003,
            "value": "Stream Phase"
        },
        {
            "id": 901000000021004,
            "value": "Physical & Magic"
        },
        {
            "id": 901000000021005,
            "value": "Weaknesses & Resistances"
        },
        {
            "id": 901000000021006,
            "value": "Status Effects"
        },
        {
            "id": 901000000021007,
            "value": "Buffs & Debuffs"
        },
        {
            "id": 901000000021008,
            "value": "Sigils & Interrupts"
        },
        {
            "id": 901000000021009,
            "value": "Control Mode"
        },
        {
            "id": 901000000021010,
            "value": "Raise (Multi Battle)"
        },
        {
            "id": 901000000021011,
            "value": "Command Shift (Multi Battle)"
        },
        {
            "id": 901000000022001,
            "value": "Criterion Dungeons"
        },
        {
            "id": 901000000022002,
            "value": "Rare Treasures (Criterion Dungeons)"
        },
        {
            "id": 901000000022003,
            "value": "Support Items"
        },
        {
            "id": 901000000022004,
            "value": "Crisis Level"
        },
        {
            "id": 901000000022005,
            "value": "Trance Abilities"
        },
        {
            "id": 901000000023001,
            "value": "Chocobo Farms"
        },
        {
            "id": 901000000023002,
            "value": "Chocobo Expeditions"
        },
        {
            "id": 901000000023003,
            "value": "Chocobo Treasures"
        },
        {
            "id": 902000000010001,
            "value": "Former SOLDIER: First Class. Joined the operations of the anti-Shinra organization Avalanche at the request of his childhood friend Tifa."
        },
        {
            "id": 902000000010002,
            "value": "A leader in the anti-Shinra organization Avalanche. Of brawny build and with a weaponized prosthetic right arm. A man of impulsive action, his hatred for Shinra runs deep."
        },
        {
            "id": 902000000010003,
            "value": "A member of the anti-Shinra organization Avalanche, and Cloud's childhood friend. Runs 7th Heaven in the Sector 7 slums."
        },
        {
            "id": 902000000010004,
            "value": "A young woman who sells flowers. She lives in the Sector 5 slums and tends to the flowers that bloom in an abandoned church on the edge of town."
        },
        {
            "id": 902000000010005,
            "value": "A beast with red fur and a fiery tail. One of a long-lived species with intelligence equal to that of humans, he is held captive in Professor Hojo's lab as a research specimen."
        },
        {
            "id": 902000000010012,
            "value": "A member of the Turks, a special task force within Shinra's General Affairs Division. His fiery-red hair and goggles set this cavalier man apart from his peers."
        },
        {
            "id": 902000000010016,
            "value": "A member of the anti-Shinra organization Avalanche. The shrewdest member of the team, he is in charge of planning their missions."
        },
        {
            "id": 902000000010017,
            "value": "A member of the anti-Shinra organization Avalanche. She manufactures whatever material the group needs for their missions, ranging from fake IDs to explosive devices."
        },
        {
            "id": 902000000010018,
            "value": "A member of the anti-Shinra organization Avalanche. Likable and well connected, he gathers the group's intel and support."
        },
        {
            "id": 902000000010020,
            "value": "A member of SOLDIER. He dreams of becoming a hero like Sephiroth and eagerly awaits opportunities to prove his merit."
        },
        {
            "id": 902000000010048,
            "value": "SOLDIER: First Class. The lone conscience among the other idiosyncratic firsts. Adored by Zack."
        },
        {
            "id": 902000000010203,
            "value": "Director of SOLDIER at Shinra. Responsible for assigning personnel to missions and developing strategy."
        },
        {
            "id": 902000000010204,
            "value": "SOLDIER: First Class. His fellow firsts Sephiroth and Angeal were dear friends."
        },
        {
            "id": 902000000011001,
            "value": "A metropolis built by the Shinra Electric Power Company. The disc-shaped city is supported in the air by eight pillars, with a mako reactor in each sector."
        },
        {
            "id": 902000000011002,
            "value": "A bar in the Sector 7 slums. Avalanche makes their base here, and its revenue funds their activities."
        },
        {
            "id": 902000000011003,
            "value": "A fort in Mt. Tamblin belonging to the Wutai army. Within its thick walls is a heavily-guarded entryway with a corridor meant to disorient invaders."
        },
        {
            "id": 902000000011004,
            "value": "An old church at the edge of the Sector 5 Slums. Despite the desolate environment, flowers bloom inside its walls."
        },
        {
            "id": 902000000011005,
            "value": "A multi-story pavilion in the inner garden of Fort Tamblin. Though a training facility for Wutai soldiers, large anti-SOLDIER monsters stand ready in case of enemy invasions."
        },
        {
            "id": 902000000011006,
            "value": "A SOLDIER training facility within the Shinra Building. The VR technology allows for combat training in various situations."
        },
        {
            "id": 902000000011007,
            "value": "An area for SOLDIERs on standby. It has rooms for meetings and training that are also utilized by scientists researching combat materia."
        },
        {
            "id": 902000000012001,
            "value": "A corporation that virtually rules the world. Once a weapons manufacturer, it gained influence over the years after they began to supply the world with mako."
        },
        {
            "id": 902000000012002,
            "value": "Facilities that draw up mako energy from within the planet and covert it to electric power. Aside from Midgar, they have also been built in other regions rich in mako."
        },
        {
            "id": 902000000012003,
            "value": "An epic poem passed down from ancient times. Many interpretations of the work exist, including plays and films, and it is currently enjoying a popular run at the playhouse in Sector 8."
        },
        {
            "id": 902000000012004,
            "value": "Farms for raising chocobos. At the chocobo farm run by Bill in the Grasslands Area, you can trade chocobo medals for chocobos or go on expeditions with your feathered friends."
        },
        {
            "id": 902000000012005,
            "value": "The main means of transportation in Midgar, run by Shinra's railway division. The trains provide service to atop the plates as well as the slums."
        },
        {
            "id": 902000000020001,
            "value": "Special materia embedded in weapons. Unlocking them activates their respective effects."
        },
        {
            "id": 902000000020002,
            "value": "A blueprint required for synthesis. Recipes are not consumed upon use."
        },
        {
            "id": 902000000020003,
            "value": "Some materia can be upgraded, allowing you to wield stronger versions of existing abilities."
        },
        {
            "id": 902000000020004,
            "value": "Weapon rarity can be increased with parts from the same weapon. Higher rarity weapons can also be obtained through draws."
        },
        {
            "id": 902000000020005,
            "value": "A place where duplicate weapons are automatically transferred and can be converted into weapon parts."
        },
        {
            "id": 902000000020006,
            "value": "Excess weapon parts can be converted into weapon components that can be traded for items."
        },
        {
            "id": 902000000020007,
            "value": "A feature that allows the strengthening of characters and summons. Limit breaks and summon abilities can be obtained through statstreams."
        },
        {
            "id": 902000000020008,
            "value": "Ultimate attacks that consume the limit gauge. Link these attacks to boost their power."
        },
        {
            "id": 902000000020009,
            "value": "Ultimate attacks that consume the summon gauge. Summon abilities can be equipped by all characters."
        },
        {
            "id": 902000000020010,
            "value": "A battle set unique to each character. Equipping battle gear changes a character's aesthetics and stats. When equipped as a costume, only the aesthetics change."
        },
        {
            "id": 902000000020011,
            "value": "A battle mode that can be challenged with party formations matching the original story. Special rewards can be obtained in this manner."
        },
        {
            "id": 902000000020012,
            "value": "During story quests, all characters receive EXP regardless of whether or not they are in the party."
        },
        {
            "id": 902000000020013,
            "value": "A battle mode that allows for free party formations regardless of the story."
        },
        {
            "id": 902000000020014,
            "value": "Passive abilities that are set to weapons. Stacking the same support ability increases its effect."
        },
        {
            "id": 902000000021001,
            "value": "A co-op battle with other players. Take on battles with friends to gain various benefits."
        },
        {
            "id": 902000000021002,
            "value": "Attack Shift focuses on offensive actions, and Defense Shit on defensive actions. They can be swapped at any time during battle. The effects of the command shift increase the longer its active."
        },
        {
            "id": 902000000021003,
            "value": "Destroy sigils that appear during an enemy's stream phase. Rely on sigil-matching abilities for greater effect."
        },
        {
            "id": 902000000021004,
            "value": "Physical strength corresponds to physical defense, and magic strength to magic defense. Conversely, high physical defense won't reduce damage taken by magic attacks, nor will magic defense affect physical damage."
        },
        {
            "id": 902000000021005,
            "value": "Enemies have various elemental weaknesses and resistances. Elemental attacks an enemy is weak against will deal more damage, but those an enemy is resistant to will deal less."
        },
        {
            "id": 902000000021006,
            "value": "Various status effects may be observed in battle."
        },
        {
            "id": 902000000021007,
            "value": "Buffs improve your stats and condition, while debuffs have the opposite effect."
        },
        {
            "id": 902000000021008,
            "value": "Bonus time to destroy sigils. Allies gain effects such as time warp during this opportunity to retaliate."
        },
        {
            "id": 902000000021009,
            "value": "The battle control mode can be changed by tapping the respective icons."
        },
        {
            "id": 902000000021010,
            "value": "An ally that has been KO'd can be revived with this multi-battle command."
        },
        {
            "id": 902000000021011,
            "value": "In multi battle, matching the strategy of each party results in a strategy bonus boost."
        },
        {
            "id": 902000000022001,
            "value": "A difficult challenge to clear a dungeon full of powerful foes. Rare rewards can be obtained by undertaking them."
        },
        {
            "id": 902000000022002,
            "value": "Treasure chests in Criterion Dungeons that can be obtained only once."
        },
        {
            "id": 902000000022003,
            "value": "Special items that can only be used in Criterion Dungeons. They have a variety of effects, such as restoring HP or filling the limit gauge."
        },
        {
            "id": 902000000022004,
            "value": "The dungeon's current danger index. It rises based on various factors, such as when a symbol enemy has been defeated."
        },
        {
            "id": 902000000022005,
            "value": "A special bonus granted to the party every time a symbol enemy is defeated in a dungeon."
        },
        {
            "id": 902000000023001,
            "value": "On chocobo farms, you can spend time with your chocobo or go on expeditions with them."
        },
        {
            "id": 902000000023002,
            "value": "Send out a chocobo with a rider, and after a set period of time, you will gain EXP and rewards based on the location of the expedition."
        },
        {
            "id": 902000000023003,
            "value": "A treasure chest that appears on chocobo farms. They can be found in random spots every day and are filled with all kinds of rewards."
        }
    ]
}