{
    "data": [
        {
            "id": 866000000003001,
            "value": "The event \"Beach Festival Fun!\" has kicked off on Sep 10, 7:00 PM PDT! Fight bosses and obtain items that can be exchanged for valuable rewards such as exclusive weapons and gear."
        },
        {
            "id": 866000000007001,
            "value": "The event \"Dungeon Ranking: Mako Reactor 1\" has kicked off at 7 PM on October 2 PDT! Explore limited-time dungeons and compete against other players for a high score! You can earn icons or blue crystals based on your score, and ranking rewards such as title plates or synth catalysts."
        },
        {
            "id": 867000000003001,
            "value": "- The contents of the event and the period held may change without prior notice.\n- Once the event's Exchange has closed, items can no longer be redeemed.\n- Even after the event has ended, items can still be redeemed within the exchange period.\n- The event can be unlocked by clearing FFVII CHAPTER 1 - MAIN SECTION 3 - EP 1.\n- The event may be held again after the event period has ended.\n- Event-exclusive items may be featured again at a later time.\n- Items that can be redeemed have an expiration date and cannot be carried over or used for later events."
        },
        {
            "id": 867000000007001,
            "value": "- The contents of the event and the period held may change without prior notice.\n- The event can be unlocked by clearing FFVII CHAPTER 1 - MAIN SECTION 3 - EP 6.\n- The Accelerated Mode cannot be used in Dungeon Ranking battles.\n- Once the event period is over, the ranking results will be announced after the calculation period.\n- The ranking results are scheduled to be announced on Oct. 10 7:00 PM PDT. \n- Ranking rewards can be obtained by going to the event page during the period in which the results are announced.\n- The event may be held again after the event period has ended.\n- Event-exclusive items may be featured again at a later time.\n- Player names may be displayed in rankings posted on official social media accounts.\n- If an irregularity is detected in your Dungeon Ranking scores, you will be subject to 2. A. Service Use Restrictions (l) and (m), and action may be taken, such as suspension of your account. If the irregularity is due to an unexpected issue, please contact customer support from Menu > Contact."
        }
    ]
}