{
    "data": [
        {
            "id": 701001,
            "value": "Confirm"
        },
        {
            "id": 701002,
            "value": "Cancel"
        },
        {
            "id": 701003,
            "value": "Back"
        },
        {
            "id": 701004,
            "value": "To Upper Tab"
        },
        {
            "id": 701005,
            "value": "To Lower Tab"
        },
        {
            "id": 701006,
            "value": "Open Menu"
        },
        {
            "id": 701007,
            "value": "Enable/Disable Auto Mode"
        },
        {
            "id": 701008,
            "value": "Enable/Disable Accelerated Mode"
        },
        {
            "id": 701009,
            "value": "Go to Home"
        },
        {
            "id": 701010,
            "value": "Go to Draws"
        },
        {
            "id": 701011,
            "value": "Open Shop Screen"
        },
        {
            "id": 701012,
            "value": "Open Gift Box Screen"
        },
        {
            "id": 701013,
            "value": "Open Mission Screen"
        },
        {
            "id": 701014,
            "value": "Move/Select"
        },
        {
            "id": 701015,
            "value": "Show Details"
        },
        {
            "id": 701016,
            "value": "Skip"
        },
        {
            "id": 701017,
            "value": "Action/Open"
        },
        {
            "id": 701018,
            "value": "Ability 1"
        },
        {
            "id": 701019,
            "value": "Ability 2"
        },
        {
            "id": 701020,
            "value": "Ability 3"
        },
        {
            "id": 701021,
            "value": "Ability 4"
        },
        {
            "id": 701022,
            "value": "Ability 5"
        },
        {
            "id": 701023,
            "value": "Limit Break 1"
        },
        {
            "id": 701024,
            "value": "Limit Break 2"
        },
        {
            "id": 701025,
            "value": "Limit Break 3"
        },
        {
            "id": 701026,
            "value": "Switch Style"
        },
        {
            "id": 701027,
            "value": "Switch Character 1"
        },
        {
            "id": 701028,
            "value": "Switch Character 2"
        },
        {
            "id": 701029,
            "value": "Dungeon/Cursor (Up)"
        },
        {
            "id": 701030,
            "value": "Dungeon/Cursor (Down)"
        },
        {
            "id": 701031,
            "value": "Dungeon/Cursor (Right)"
        },
        {
            "id": 701032,
            "value": "Dungeon/Cursor (Left)"
        },
        {
            "id": 701033,
            "value": "Raise"
        },
        {
            "id": 701034,
            "value": "Ally Selection 1"
        },
        {
            "id": 701035,
            "value": "Ally Selection 2"
        },
        {
            "id": 701036,
            "value": "Ally Selection 3"
        },
        {
            "id": 701037,
            "value": "Begin"
        },
        {
            "id": 701038,
            "value": "Move UI Cursor Area (Backward)"
        },
        {
            "id": 701039,
            "value": "Move UI Cursor Area (Forward)"
        },
        {
            "id": 701040,
            "value": "Show Key Config. Guide"
        },
        {
            "id": 701041,
            "value": "Show Key Config. Guide"
        },
        {
            "id": 701042,
            "value": "Show the Key Config settings in-game."
        },
        {
            "id": 701043,
            "value": "Go to Growth"
        },
        {
            "id": 701044,
            "value": "Go to Enhance"
        },
        {
            "id": 701045,
            "value": "Go to Party"
        },
        {
            "id": 701046,
            "value": "Open the Season Pass screen"
        },
        {
            "id": 701047,
            "value": "Open the Friends screen"
        },
        {
            "id": 701048,
            "value": "Open the Notices screen"
        },
        {
            "id": 701049,
            "value": "Challenge/Accept Guide Missions"
        },
        {
            "id": 702001,
            "value": "General"
        },
        {
            "id": 702002,
            "value": "Story"
        },
        {
            "id": 702003,
            "value": "Battle"
        },
        {
            "id": 702004,
            "value": "Switch"
        },
        {
            "id": 702005,
            "value": "Key Config"
        },
        {
            "id": 702006,
            "value": "Change key settings for the following operations.\\nEnter the key you want to change."
        },
        {
            "id": 702007,
            "value": "Current"
        },
        {
            "id": 702008,
            "value": "Preview"
        },
        {
            "id": 702009,
            "value": "Set to Unassigned"
        },
        {
            "id": 702010,
            "value": "Cancel"
        },
        {
            "id": 702011,
            "value": "OK"
        },
        {
            "id": 702012,
            "value": "*The following operation is assigned\\nto the key you are trying to change."
        },
        {
            "id": 702013,
            "value": "Do you want to change the input key for the following operation?"
        },
        {
            "id": 702014,
            "value": "Screen Settings"
        },
        {
            "id": 702015,
            "value": "Display Mode"
        },
        {
            "id": 702016,
            "value": "You can set the display mode."
        },
        {
            "id": 702017,
            "value": "Resolution"
        },
        {
            "id": 702018,
            "value": "You can set the resolution (screen size)."
        },
        {
            "id": 702019,
            "value": "Anti-Aliasing"
        },
        {
            "id": 702020,
            "value": "Toggle anti-aliasing on/off. \\n*Depending on your system, this may result in performance issues."
        },
        {
            "id": 702021,
            "value": "Shadows"
        },
        {
            "id": 702022,
            "value": "You can toggle shadows to be on/off."
        },
        {
            "id": 702023,
            "value": "Fullscreen Mode"
        },
        {
            "id": 702024,
            "value": "Window Mode"
        },
        {
            "id": 702025,
            "value": "Switch Server"
        },
        {
            "id": 702026,
            "value": "Please select a server."
        },
        {
            "id": 702027,
            "value": "Japan"
        },
        {
            "id": 702028,
            "value": "Other"
        },
        {
            "id": 702029,
            "value": "Performance Settings"
        },
        {
            "id": 702030,
            "value": "If the game is not running smoothly,\\nchanging settings may improve performance."
        },
        {
            "id": 702031,
            "value": "*This does not guarantee an improvement in performance."
        },
        {
            "id": 702032,
            "value": "Recommended"
        },
        {
            "id": 702033,
            "value": "Zoom In"
        },
        {
            "id": 702034,
            "value": "Zoom Out"
        },
        {
            "id": 702035,
            "value": "Exit Game"
        },
        {
            "id": 702036,
            "value": "Keyboard Settings"
        },
        {
            "id": 702037,
            "value": "Configure key settings for keyboard controls."
        },
        {
            "id": 702038,
            "value": "Confirm"
        },
        {
            "id": 702039,
            "value": "Auto Selection"
        },
        {
            "id": 702040,
            "value": "FPS"
        },
        {
            "id": 702041,
            "value": "You can set the number of frames displayed per second."
        },
        {
            "id": 702042,
            "value": "Vsync"
        },
        {
            "id": 702043,
            "value": "Synchronize the timing of the frame updates with your monitor's vertical refresh rate."
        },
        {
            "id": 702044,
            "value": "Purchase canceled."
        },
        {
            "id": 702045,
            "value": "Keyboard and Mouse Settings"
        },
        {
            "id": 702046,
            "value": "Cursor Lock"
        },
        {
            "id": 702047,
            "value": "You can lock the mouse cursor to stay within the game window."
        },
        {
            "id": 702048,
            "value": "*Only available in window mode."
        },
        {
            "id": 702049,
            "value": "Mouse Acceleration"
        },
        {
            "id": 702050,
            "value": "You can toggle mouse acceleration on/off."
        },
        {
            "id": 702060,
            "value": "Performance Settings"
        },
        {
            "id": 702061,
            "value": "Brightness"
        },
        {
            "id": 702062,
            "value": "Set brightness for content displayed in 3D such as battles.\\nThis setting will not be reflected if screen setting is set to low."
        },
        {
            "id": 702063,
            "value": "If the game is not running smoothly,changing settings may improve performance."
        },
        {
            "id": 702064,
            "value": "*This does not guarantee performance improvement."
        },
        {
            "id": 702065,
            "value": "Left-Handed Mode"
        },
        {
            "id": 702066,
            "value": "Inverts the mouse axis (Confirm/Cancel)."
        },
        {
            "id": 702067,
            "value": "Network Error"
        },
        {
            "id": 702068,
            "value": "Retry"
        },
        {
            "id": 702069,
            "value": "Unable to connect. \\nRetry?"
        },
        {
            "id": 702070,
            "value": "Please choose your preferred settings."
        },
        {
            "id": 702071,
            "value": "*This setting can be changed later."
        },
        {
            "id": 702072,
            "value": "Displayed Language Settings"
        },
        {
            "id": 702073,
            "value": "Select your preferred language."
        },
        {
            "id": 702074,
            "value": "Current Settings:"
        },
        {
            "id": 702075,
            "value": "日本語"
        },
        {
            "id": 702076,
            "value": "English"
        },
        {
            "id": 702077,
            "value": "Change Language"
        },
        {
            "id": 702078,
            "value": "Switch to the selected language? "
        },
        {
            "id": 702079,
            "value": "Selected Language"
        },
        {
            "id": 702080,
            "value": "Switch"
        },
        {
            "id": 702081,
            "value": "Language Settings"
        },
        {
            "id": 702082,
            "value": "Displayed Language"
        },
        {
            "id": 702083,
            "value": "You can set the displayed language."
        },
        {
            "id": 702084,
            "value": "*In order to reflect the change, you will be returned to the title screen."
        },
        {
            "id": 702085,
            "value": "{0} d, yyyy, h:mm:ss {1}"
        },
        {
            "id": 702086,
            "value": "{0} d, yyyy, h:mm {1}"
        },
        {
            "id": 702087,
            "value": "{0} d, yyyy"
        },
        {
            "id": 702088,
            "value": "d/M/yyyy HH:mm:ss"
        },
        {
            "id": 702089,
            "value": "d/M/yyyy HH:mm"
        },
        {
            "id": 702090,
            "value": "d/M/yyyy HH:mm"
        },
        {
            "id": 702091,
            "value": "{0} d, h:mm {1}"
        },
        {
            "id": 702092,
            "value": "h:mm:ss {1}"
        },
        {
            "id": 702093,
            "value": "h:mm {1}"
        },
        {
            "id": 702094,
            "value": "Set image and performance quality."
        },
        {
            "id": 702095,
            "value": "*Data will begin downloading on the\\ntitle screen after clearing the cache."
        },
        {
            "id": 702096,
            "value": "<align=\"center\">ユーザー規約</align>\n<align=\"center\">（FINAL FANTASY VII EVER CRISIS）</align>\n\n\nお客様（以下「ユーザー」といいます）による、株式会社スクウェア・エニックス（以下「当社」といいます）が提供する表題記載のサービス（以下「本サービス」といいます）の利用については、このユーザー規約（以下「本規約」といいます）が適用されます。ユーザーは、本サービスの利用にあたり、本規約に加えて、本サービスが提供されるマーケット、ストア等の利用規約（以下「ストア利用規約」といいます）についても遵守してください。\n\nユーザーが未成年の場合：\n* 保護者の明確な同意を得たうえで、本規約に同意してください。\n* 本サービスの利用が日常生活に支障をきたすことのないよう、本サービスの利用時間等につき、保護者と相談をして決めてください。\n\n1.  本サービスの利用許諾\n\n本規約に同意することを条件として、当社はユーザーに対して、本サービス（ソースコード及びオブジェクトコードを除きます）を個人的に利用する非独占的な権利を許諾します。\nユーザーは、本サービスの性質上、本サービスが当社の合理的な裁量に基づき変更、中断、利用制限され、また提供が終了することを理解した上で本サービスを利用するものとします。\nなお、本規約以外に、本サービスに関する追加または異なる取引条件を定めるガイドライン、ルール、利用条件、販売条件等（以下「追加規約」といいます）が存在する場合、これらもユーザーによる本サービスの利用に適用されます。本規約と追加規約が矛盾する場合、追加規約が優先して適用されます。ただし、追加規約に本規約が優先されることが明示的に記載されている場合は、この限りではありません。\n\n2.  禁止行為\n\n当社は、全ての利用者に楽しい体験をしていただくため、また、当社の知的財産権を守るために、本条に定める行為（以下「禁止行為」といいます）を厳に禁止します。なお禁止行為には、禁止行為の準備行為や禁止行為をほう助したり、そそのかしたりする行為も含まれます。\n当社は、ユーザーが本規約に違反した場合、または禁止行為を行った場合（禁止行為を行ったと当社が信じるに足る合理的な理由がある場合を含みます）、当該違反及び行為の内容に応じ、当社の合理的な裁量により、以下を含む様々な対応を行うことができます。なお、当社はユーザーの行為が禁止行為に該当するか否かを調査する目的で、一時的に以下に定める措置をとる場合があります。\n•  警告\n•  不正に取得したゲーム内アイテムまたは通貨の削除\n•  ゲーム内通貨購入の一時的又は永久的な制限\n•  アカウントの一時的又は永久的な停止\n•  契約違反、著作権侵害その他の理由による法的措置（訴訟、差し止めを含みます）\n\n2.1  アカウント情報の共有  ユーザーはストア利用規約で許される場合を除き、アカウント情報またはログイン情報を他者と共有しないものとします。\n\n2.2  阻害行為  ユーザーは、当社のコンピュータ及びサーバーの阻害を含み、当社及び他の利用者による本サービスの利用を阻害しないものとします。阻害行為には、本サービスに関するカスタマーサポート窓口に過度の問い合わせを送るなどして、他の利用者による正当なカスタマーサポートの利用を阻害する行為が含まれます。\n\n2.3  誹謗中傷  ユーザーは、本サービスの利用において、通常の人間が、攻撃的、わいせつ、過激、その他不適切と考えるであろう表現を用いないものとします。\n\n2.4  なりすまし  ユーザーはいかなる個人または団体にもなりすましてはならず、また、自身を当社の従業員、代表者その他当社の関係者であるかのように詐称してはならないものとします。ユーザーの安全のために、当社はユーザーが自身のプライバシーに配慮し、匿名性を維持し、他の利用者に対して個人情報を提供しないことを推奨します。 \n\n2.5  当社及び第三者の名称、知的財産権等の使用  ユーザーは、当社、その他の第三者が有する名称その他の知的財産権（ユーザー名やキャラクター名を有名人、企業、商品または既存のキャラクターの名称にすることを含みます）を本サービスにおいて使用しないものとします。\n\n2.6  違法行為  ユーザーは、本サービスに関連して違法行為を行わないものとします。違法行為には、著作権侵害、商標権侵害、ギャンブル、中傷、脅迫、詐欺等を含みます。\n\n2.7  偽の情報の提供  ユーザーは、本サービスの利用にあたり、当社及び本サービスが提供されるマーケット、ストア等に対して偽の情報を提供してはならないものとします。\n\n2.8  ハラスメント  ユーザーは、本サービスの利用に関連して、他の利用者、当社、その他の第三者に嫌がらせを行ってはならないものとします。\n\n2.9  チートまたはボットの利用  ユーザーは、チート、ボット、自動ソフトウェア、不正侵入ソフト、モッド、その他本サービスを不正利用する事、また本サービスを改変する事などを目的とするソフト等を制作しまたは利用しないものとします。\n\n2.10  不具合等の利用  ユーザーは、本サービスのシステムの不具合またはセキュリティー上の弱点を利用しないものとします。また、本サービスの機能等を本来の目的以外の目的で利用しないものとします。\n\n2.11  リアルマネートレーディング、ファーミング、パワーレベリング等  ユーザーは、本サービスの利用を通じて生成もしくは取得されるすべてのデータ（以下「アカウント等」といい、アカウント、キャラクター、ゲーム内通貨、数値・データ、その他のゲーム内アイテムを含みますが、それらに限られません）を、直接、第三者による仲介、またはインターネットオークション等の手段を問わず、対価（金銭、物品、その他の財産上の利益、本サービス以外のサービス上の通貨、キャラクター、アイテム、ポイント、データ、情報等を含みます。以下、同じ。）と引き換えに、譲渡、譲受、貸与、借用、委任等しないものとします。また、ユーザーは、第三者の代わりにアカウント等を取得したり、ゲームプレイの進行を行ったり、第三者に対価と引き換えにアカウント等を販売する目的で本サービスを利用しないものとします。\n\n2.12  商用利用  ユーザーは、当社の事前の書面による承諾なく、本サービスを商業的な目的で利用しないものとします。\n\n2.13  プライベートサーバーの利用  ユーザーは第三者のサーバーに接続して、本サービスと同一または類似のサービスを利用してはならないものとします。 \n\n2.14  データ収集  ユーザーは、当社が明示的に認めている場合を除き、本サービスから情報を傍受、取り出しまたはその他収集しないものとします。\n\n2.15  ハッキング及び迂回行為  ユーザーは、いかなる場合も本サービスに関連するサーバー、アプリケーション、データ、コードなどをハッキング、その他改変をしないものとします。\n\n2.16  解析行為  ユーザーは、当社が許可した場合を除き、いかなる場合も本サービスに関連するサーバー、アプリケーション、データ、コードなどの複製およびリバースエンジニアリング（解析、逆アッセンブル、およびデコンパイルを含みます）をしないものとします。\n\n2.17  改変または二次著作物の制作  ユーザーは、当社が明示的に許諾する場合を除き、本サービスの構成要素を改変しないものとし、また、本サービスの二次著作物を制作しないものとします。\n\n2.18  商業スパム/スピムの使用  ユーザーは、本サービスにおいて提供されているチャット、メッセージサービス等の機能を、その目的以外の目的に使用しないものとします。\n\n2.19  複数アカウント取得  ユーザーは、当社が明示的に許諾する場合を除き、本サービスにおいて、自己が作成・管理するアカウントを複数所持してはならず、また当該複数アカウントを使用して本サービスを利用しないものとします。\n2.20  返金申請による利得行為  ユーザーは、本サービスが提供されるマーケット、ストア等が提供する課金サービスにおいて利得することを目的として返金申請を行わないものとします。なお、返金申請が利得目的であるかどうかの判断は、当社の合理的な判断によるものとします。\n\n2.21  禁止行為に対する当社の措置を迂回する行為  ユーザーは、本サービスに関して、本条違反に基づき当社よりアカウントの停止または終了措置を受けている場合、当該停止または終了を迂回する目的で異なる登録情報を用いて再登録することはできません。\n\n2.22  不正に入手したアカウント等の利用  ユーザーは、本サービス以外のアプリまたはサービス等を経て入手したアカウント等、または本サービスが提供されるマーケット、ストア等を除く第三者から入手したアカウント等を、本サービスで利用することはできません。\n\n2.23  その他本サービスの提供に悪影響を及ぼす行為  ユーザーは、前各項に加え、当社が本サービスの提供に悪影響を及ぼすと判断する行為を行わないものとします。\n\n3.  権利帰属\n\n当社（該当する場合はそのライセンサーも含む）は、本サービスに関する一切の権利を保有し、それらに関するすべての権利及び権限を将来に渡って有しており、且つ、アカウント等に関する一切の権利（知的財産権を含みます）を有します。当社は、本サービスに内包されるすべてのコンピューターコード、タイトル、テーマ、物体、キャラクター、キャラクターの名称、アニメーション、プロセス、肖像、楽曲とその録音物、ストーリー、環境、建物、美術、音声その他に関する著作権その他の知的財産権のすべてを有します。ユーザーは、本規約で認められている限定的な範囲において本サービスにアクセスし利用する権利のみを付与されています。\n\n4.  アカウント等\n\n4.1  利用許諾  ユーザーは、本サービスにおいてユーザーのアカウント等を利用する権利のみを許諾されています。ユーザーは、ユーザーのアカウント等を、いかなる目的においても、販売、貸与又は複製することはできません。もしユーザーがこれらの行為を行った場合、本規約に基づく本サービスの利用許諾は直ちに無効となります。ユーザーは、自己が行ったか否かを問わずアカウント等の利用及び管理について一切の責任を負うものとします。\n\n4.2  管理  ユーザーは、当社がアカウント等を本サービスの提供に必要な範囲で管理、変更、運用する権利を有することを認めます。ユーザーが、アカウント等に関して何らかの詐欺的行為、濫用、若しくは違法な行為を行った又はそのおそれがあると当社が判断した場合、またはユーザーが本規約に違反した又はそのおそれがあると当社が判断した場合、当社は予告なくユーザーのアカウント等を変更、削除または利用不可能とし、もしくはユーザーの本サービスへのアクセスを停止または終了することができます。当社はユーザーまたはいかなる第三者に対してもこの権利の行使について、当社の責めに帰すべき事由がある場合を除き、責任を負いません。\n\n4.3  不使用による削除  当社は、ユーザーが1年間本サービスを利用していないと判断した場合、ユーザーへ通知をすることなく、またユーザーの承諾を得ることなく、ユーザーのアカウント等を削除する場合があり、ユーザーは予めこれに同意するものとします。ただし、ユーザーが有償で購入したゲーム内通貨については、この限りではありません。\n\n5.  ゲーム内通貨\n\n5.1  ゲーム内通貨の導入  本サービスでは本サービス内でのみ利用可能な仮想の通貨（以下「ゲーム内通貨」といいます）を採用する場合があります。ゲーム内通貨は、当社が本サービス内で提供する一定のバーチャルな商品またはサービスを取得するために利用することができます。\n\n5.2  ゲーム内通貨は、アカウント等の一部をなし、当社は、ユーザーにその利用のみを許諾しています。適用法令に異なる定めがある場合を除き、ゲーム内通貨は何らの換価価値を有さず、ユーザーはゲーム内通貨を本規約に従って利用する権利の他、何らの権利も有さず、当社が当社の裁量でゲーム内通貨と交換可能と定めるバーチャルな商品またはサービスを除き、現金、通貨、ライセンスまたは権利等、いかなるものとも交換することはできません。ユーザーはゲーム内通貨をいかなる個人または団体に対して移転することはできず、また、いかなる個人または団体からも受領することはできません。\n\n5.3  ゲーム内通貨の追加  当社が本サービスにおいてゲーム内通貨を採用した場合、ユーザーは、本サービスが定める支払方法を利用することにより、ユーザーのアカウントにゲーム内通貨を追加することができます。未成年のユーザーが保護者名義のクレジットカード等の支払手段を利用する場合は、当該保護者の明示的な同意を得なければならないものとします。当社は通知なく当社の裁量でいつでもゲーム内通貨の価格を変更する権利を有するものとします。ユーザーは、ゲーム内通貨の追加に要する金額にかかる税金等の支払い責任を負うものとします。\n\n5.4  ゲーム内通貨に係る制限  ユーザーの安全を確保し、詐欺等による被害を防止することを目的として、当社は本サービスにおいてユーザーに許諾される一回当たりまたは月あたりのゲーム内通貨の数もしくは使用金額に制限を設けることができます。同様に、当社はユーザーがユーザーのアカウント内に保有できるゲーム内通貨等の数に制限を設けることができるものとします。\n\n5.5  ゲーム内通貨の利用  ユーザーはゲーム内通貨を、当社が本サービス内で提供する一定のバーチャルな商品またはサービスに交換することができます。当社はいつでも当社の裁量により、ユーザーに対して通知することなく個別の商品またはサービスと交換するために必要となるゲーム内通貨の数を変更する権利を留保します。一旦商品またはサービスと交換したゲーム内通貨はユーザーのアカウントから減らされ、再度利用することはできません。また、ユーザーは一度完了した取引（ゲーム内通貨と本サービス内のバーチャルな商品またはサービスとの交換をいいます）を取り消すことはできません。ただし、当社は、不正な取引が確認された場合、当該取引を取り消しまたは無効とする権利を留保します。\n\n5.6  払い戻し不可  法令により認められる場合を除き、ユーザーはいかなる場合においても未使用のゲーム内通貨について払い戻しを受けることができないものとします。\n\n5.7  ゲーム内通貨の使用期限及びゲーム内通貨の採用終了  ゲーム内通貨の使用期限はありません。但し、当社が本サービスにおいてゲーム内通貨を採用した場合であっても、当社は、本サービスにおいて継続してゲーム内通貨を採用する義務を負わず、また当社の裁量によりいつでも本サービスにおけるゲーム内通貨の採用を中止することができます。\n\n6.  本サービスの終了\n\n当社は、60日の事前通知をもっていつでも本サービスを終了することができます。\n\n7.  個人情報等の取扱い\n\n7.1  プライバシー・ポリシー  当社は、当社のプライバシー・ポリシー(http://www.jp.square-enix.com/privacy/)に従い、ユーザーの個人情報を適切に取り扱います。\n\n7.2  利用状況のモニタリング  ユーザーは、当社がユーザーによる本サービスの利用をモニタリングすることにより、ユーザーによる本サービスの利用をサポートし、ユーザーが本規約を遵守していることを確認できることに同意するものとします。また当社は、前記情報を、本サービスを改善するために利用することができるものとします。\n\n7.3  政府機関への提出  当社は、召喚状や捜査令状の有無に拘らず、政府の法的執行機関に協力するため、ユーザーのアカウント等、電子的コミュニケーションの履歴、及びその他のデータ（個人情報、電子メール及びチャットログを含む）を当該政府機関へ提出する可能性があり、ユーザーは上記に関し同意するものとします。\n\n8.  リンクサイト及び第三者との取引\n\n8.1  リンクサイト  本サービスには、第三者のウェブサイト、アプリ、その他の場所（以下「リンクサイト」といいます）へのリンクが含まれている場合があります。当社は、リンクサイトのコンテンツ、運用、ポリシー、取引条件、その他の要素に関するコントロール権を有しておらず、当該リンクサイトを確認する義務を負わず、また、当該リンクサイト及び当該リンクサイトに含まれる第三者のコンテンツ、広告、情報、素材、商品、サービス、その他のアイテムを支持、承認、スポンサーするものではありません。ユーザーがリンクサイトに関連しておこなう行為には、当該リンクサイトの運営者が発行するプライバシー・ポリシー等のポリシー、利用規約等が適用されます。リンクサイトにて提供、アクセス、取得、広告されている商品またはサービスの品質または納入に関する問題、及びリンクサイト内に含まれる情報またはコンテンツの表示、配信、活用を原因とした損害の発生等、ユーザーによるリンクサイトの利用に起因して生じた問題については、ユーザー自らの費用と責任で対応するものとします。\n\n8.2  第三者との取引  ユーザーが本サービス上、または本サービスを通して（リンクサイトまたは広告上もしくはそれらを経由した場合を含みます）第三者と行う取引は、ユーザーと当該第三者との間の取引です。ユーザーは、当該取引を自らの費用と責任で行うものとします。\n\n9.  一般条項\n\n9.1  補償  ユーザーは、本サービスの利用、禁止行為への関与、本サービスに関してユーザーが提供、リンク、送信、利用可能とした内容、本規約の違反、他の利用者の権利に対する侵害、その他のユーザーの行為から発生するすべての請求、訴訟、法的措置、費用、弁護士費用を含む裁判費用、経費を、当社、当社のグループ会社、運営会社又はこれらの従業員等に対し補償し、一切の迷惑をかけないものとします。\n\n9.2  保証の否定  当社はユーザーによる本サービスの利用に関し、本規約で明確に定められている場合を除き、明示及び黙示のいずれにおいても、法令に基づく保証を除き、いかなる保証（商品性、特定の目的への適合性、権利の非侵害に関する黙示の保証を含みますが、これらに限りません）もいたしません。また、本サービスは「現状有姿」で提供され、本規約で明確に定められている以外のいかなる保証もないものとします。当社は、本サービスがユーザーの要望にこたえること、また、本サービスが中断やエラーの発生無く機能することを保証しません。\n\n9.3  責任の制限  当社、当社のグループ会社、運営会社又はこれらの従業員等は、本規約、本サービス、およびアカウント等に起因又は関連して発生するいかなる損害（特別損害、間接損害、偶発的損害、派生的損害、データ消失、利益損失、機会損失等を含み、法理論のいかんを問いません）についても、当社、当社のグループ会社、運営会社又はこれらの従業員等の責めに帰すべき事由による損害を除き、ユーザーに対して責任を負いません。また、当社、当社のグループ会社、運営会社又はこれらの従業員等がユーザーに対して法的責任を負う場合であっても、その上限額は、ユーザーが本サービスに関して当社に対して直近の1か月に支払った金額を超えないものとします。但し、当該損害が当社、当社のグループ会社、運営会社又はこれらの従業員等の故意又は重過失による場合は、この限りではありません。\n\n9.4  差止による救済  ユーザーは、いかなる場合においても、差止めによる救済、その他禁止命令、規制、その他当社又は本サービスまたはこれに関連する商品またはサービスの頒布、取引、開発及び実施を妨げる救済を得る権利がないことに同意します。\n\n9.5  準拠法及び裁判管轄  本規約は、法の抵触のルールを排除したうえで、日本法に準拠し、同法に従って解釈されます。本規約の当事者は、本規約又は本サービスから発生し又は関連するあらゆる訴訟及び法的手続きについて、東京地方裁判所の第一審専属的管轄権に取消し不能の形で服するものとします。前記訴訟においてユーザーが敗訴した場合、係る訴訟に伴って当社、当社のグループ会社、運営会社又はこれらの従業員等に発生した訴訟費用及び合理的な弁護士費用は、ユーザーが負担するものとします。本サービスの提供地域は日本国とし、当社は、本サービスが他の地域において適切、適法又は利用可能であることについて保証をしません。\n\n9.6  ユーザー間の紛争  ユーザーは、本サービスに関連してユーザーと他の利用者を含む第三者との間で発生した紛争について、自らの費用と責任で対応するものとします。\n\n9.7  分離可能性  本規約のいずれかの文言又は条項が、適法な管轄権を持つ裁判所によって無効又は強制力を持たないと裁定された場合、かかる文言又は条項は、当該裁判所の当該訴訟における裁定で最大限認められた範囲においてのみ有効且つ強制力を持つと解釈されるものとし、その場合であっても、本規約の他の文言及び条項は、影響を受けることも損なわれることも無く、有効に存続するものとします。\n\n9.8  権利放棄の否定  当社による、本規約上のあらゆる条件又は条項に関する権利放棄は、それが行為又はそれ以外の手段によるものかは問わず、一つまたは複数の事例であっても、当該条件又は条項に関する更なる又は継続した権利放棄、或いは、本規約の他の条件又は条項に関する権利放棄とは解釈されません。当社、当社のグループ会社、運営会社又はこれらの従業員等のユーザーと接する機会のある者は、本規約上のいかなる条件についても修正又は権利放棄をする法的な権限を当社から与えられておりません。\n\n9.9  権利譲渡  当社は当社の裁量により、本規約に定める権利義務の全部または一部を、ユーザーを含む利用者への通知をすることなく第三者に譲渡または委任することができるものとします。ユーザーの権利はユーザー本人に帰属するものであり、第三者に譲渡することはできません。\n\n9.10  完全合意  本規約は、プライバシー・ポリシー及び本サービスの利用に関連するその他の利用規約類と共に、本サービスの利用にあたっての、ユーザーと当社間におけるすべての了解と合意を構成するものであり、本規約に関連する事項につき、口頭又は書面で行われた従前の一切の情報のやりとりに取って代わり、それらすべては本規約に包含されます。\n\n9.11  本規約の変更  当社は当社の裁量により、いつでも、本規約及び本サービスのいかなる条件も、変更、改訂、追加、補足及び削除する権利を留保しています。当社は当社の裁量により、Eメール、ウェブサイトへ掲載、ポップアップスクリーン又はサービス内通知の方法その他の適切な方法により当該変更をユーザーに通知するものとします。本規約及び本サービスの変更は、当該通知の際に定める適用開始日から適用されるものとします。ユーザーが将来実施される本規約の変更を受容できない場合、ユーザーは、本サービスの利用を終了することにより本規約を解約することができます。\n\n9.12 サポートセンター  本サービスについてご質問等がある場合には、本サービスまたは本サービスの公式サイトに記載したサポート窓口までお問い合わせください。\n\n10.  本サービス内のバーチャルな商品及びサービスの扱いについて\n\n本サービス内のバーチャルな商品のうち、別途「資金決済法に基づく表示」と題するページに前払式支払手段として表示するゲーム内通貨は、「資金決済に関する法律」に基づき前払式支払手段として取扱われます。当該前払式支払手段との交換により入手又は提供されたその他のバーチャルな商品及びサービスは、交換をもってこれにかかる商品・サービスの提供がなされたものとし、前払式支払手段に該当しません。\n\n11.  ユーザー情報の外部送信について\n\n本サービスにおいては、以下の外部サービスを利用しています。これらの外部サービスの提供者、利用目的及び提供されるユーザーの情報は、以下のとおりです。\n\n・AppsFlyer（AppsFlyer Japan株式会社）\n提供するユーザーの情報：①IDFA、AAID、Steam ID、購入履歴、ゲームの進捗情報、②IDFV、OS/ブラウザの種類やバージョン、デバイスの種類および画面サイズ、アプリの利用日時、購入履歴、ゲームの進捗情報、IPアドレス\n利用目的：①カスタマイズされた広告配信、②パフォーマンスの測定\n\n・BugSnag（SmartBear Software）\n提供するユーザーの情報：ユーザーID、OS情報、デバイス名/スペック情報、クラッシュデータ、UUID\n利用目的：クラッシュの調査・分析のため\n\n\n<align=\"right\">以上</align>\n\n2023年11月20日　制定"
        },
        {
            "id": 702097,
            "value": "YetAnotherHttpHandler / MIT License\n-----------------------------------\nhttps://github.com/Cysharp/YetAnotherHttpHandler\n\nCopyright (c) Cysharp, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nUses Megascans®. Copyright © - 2023 Epic Games, Inc.\n<megascans_logo>\n\nCRIWARE\n-------\nPowered by \"CRIWARE\".CRIWARE is a trademark of CRI Middleware Co., Ltd.\n\n\nSteamworks.NET / MIT License\n----------------------------\nhttps://steamworks.github.io/\n\n© 2023 Valve Corporation.All rights reserved.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nAdjust / MIT License\n--------------------\nhttps://www.adjust.com/\n\nGitHub : adjust / unity_purchase_sdk\nhttps://github.com/adjust/unity_purchase_sdk\n\nCopyright (c) 2016-2019 Adjust GmbH, http://www.adjust.com\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nAppsFlyer / MIT License\n-----------------------\nhttps://github.com/AppsFlyerSDK/appsflyer-unity-plugin/blob/master/LICENSE\n\nCopyright (c) 2019 AppsFlyerSDK\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nProtocol Buffers - Google's data interchange format / 3-clause BSD license\n--------------------------------------------------------------------------\nhttps://github.com/protocolbuffers/protobuf\n\nCopyright 2008 Google Inc.  All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n    * Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n    * Neither the name of Google Inc. nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nCode generated by the Protocol Buffer compiler is owned by the owner of the input file used when generating it.  This code is not standalone and requires a support library to be linked with it.  This support library is itself covered by the above license.\n\n\ngRPC – An RPC library and framework / Apache License, version 2.0\n-----------------------------------------------------------------\nhttps://github.com/grpc/grpc\n\nCopyright 2016, Google Inc.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n   http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\nMoonSharp / 3-clause BSD license\n--------------------------------\nhttps://github.com/moonsharp-devs/moonsharp\n\nCopyright (c) 2014-2016, Marco Mastropaolo\nAll rights reserved.\n\nParts of the string library are based on the KopiLua project (https://github.com/NLua/KopiLua)\nCopyright (c) 2012 LoDC\n\nVisual Studio Code debugger code is based on code from Microsoft vscode-mono-debug project (https://github.com/Microsoft/vscode-mono-debug).\nCopyright (c) Microsoft Corporation - released under MIT license.\n\nRemote Debugger icons are from the Eclipse project (https://www.eclipse.org/).\nCopyright of The Eclipse Foundation\n\nThe MoonSharp icon is (c) Isaac, 2014-2015\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n* Redistributions of source code must retain the above copyright notice, this\n  list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above copyright notice,\n  this list of conditions and the following disclaimer in the documentation\n  and/or other materials provided with the distribution.\n\n* Neither the name of the {organization} nor the names of its\n  contributors may be used to endorse or promote products derived from\n  this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\nAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\nIMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\nOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\n\nParticle Effect For UGUI (UI Particle) / MIT License\n----------------------------------------------------\nhttps://github.com/mob-sakai/ParticleEffectForUGUI\n\nCopyright 2018-2022 mob-sakai\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nMiniJSON.cs / MIT License\n-------------------------\nhttps://gist.github.com/darktable/1411710\n\nCopyright (c) 2013 Calvin Rien\n\nBased on the JSON parser by Patrick van Bergen\nhttp://techblog.procurios.nl/k/618/news/view/14605/14863/How-do-I-write-my-own-parser-for-JSON.html\n\nSimplified it so that it doesn't throw exceptions\nand can be used in Unity iPhone with maximum code stripping.\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, sublicense, and/or sell copies of the Software, and to\npermit persons to whom the Software is furnished to do so, subject to\nthe following conditions:\n\nThe above copyright notice and this permission notice shall be\nincluded in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND,\nEXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY\nCLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,\nTORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE\nSOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nsimple-disk-utils / MIT License\n-------------------------------\nhttps://github.com/dkrprasetya/simple-disk-utils\n\nCopyright (c) 2016 M Dikra Prasetya\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nMessagePack for C# / MIT License\n--------------------------------\nhttps://github.com/neuecc/MessagePack-CSharp\n\nCopyright (c) 2017 Yoshifumi Kawai and contributors\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\n\nlz4net\n\nCopyright (c) 2013-2017, Milosz Krajewski\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\nFooter\n\n\nMasterMemory / MIT License\n--------------------------\nhttps://github.com/Cysharp/MasterMemory\n\nCopyright (c) 2019 Yoshifumi Kawai / Cysharp, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nMagicOnion / MIT License\n------------------------\nhttps://github.com/Cysharp/MagicOnion\n\nCopyright (c) Yoshifumi Kawai\nCopyright (c) Cysharp, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nUniRX / MIT License\n-------------------\nhttps://github.com/neuecc/UniRx\n\nCopyright (c) 2018 Yoshifumi Kawai\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nUniTask / MIT License\n---------------------\nhttps://github.com/Cysharp/UniTask\n\nCopyright (c) 2019 Yoshifumi Kawai / Cysharp, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\nSOFTWARE.\n\n\nZString / MIT License\n---------------------\nhttps://github.com/Cysharp/ZString\n\nCopyright (c) 2020 Cysharp, Inc.\n\nPermission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all\ncopies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nUnityChanSpringBone / MIT License\n---------------------------------\nhttps://github.com/unity3d-jp/UnityChanSpringBone\n\nCopyright (c) 2018 Unity Technologies ApS\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n\nAdvertisement / Unity Companion License\n---------------------------------------\nhttps://docs.unity3d.com/ja/2019.4/Manual/com.unity.ads.html\n\nUnity Advertisements copyright © 2021 Unity Technologies. This software is subject to, and made available under, the terms of service for Operate Solutions (see https://unity3d.com/legal/one-operate-services-terms-of-service), and is an \"Operate Service\" as defined therein.\n\nYour use of the Services constitutes your acceptance of such terms. Unless expressly provided otherwise, the software under this license is made available strictly on an \"AS IS\" BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the terms of service for details on these and other terms and conditions.\n\n\nGoogle Analytics Plugin for Unity / Apache License, version 2.0\n---------------------------------------------------------------\nhttps://github.com/googleanalytics/google-analytics-plugin-for-unity\n\nCopyright (c) 2014 Google Inc. All rights reserved.\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n   http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\nCinemachine / Unity Companion License\n-------------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.cinemachine@2.9/manual/index.html\n\nCinemachine copyright © 2020 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nScriptable Render Pipeline / Unity Companion License\n----------------------------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.render-pipelines.core@7.4/manual/index.html\n\ncom.unity.render-pipelines.core copyright © 2020 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nUnity In App Purchasing / Unity Companion Package License v1.0\n--------------------------------------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.purchasing.udp@1.0/manual/Implementing-IAP.html\n\nCopyright (c) 2019 Unity Technologies ApS (\"Unity\")\n\nUnity Companion Package License v1.0\nhttps://docs.unity3d.com/Packages/com.unity.purchasing.udp@1.0/license/LICENSE.html\n\n\nBugsnag / MIT License\n---------------------\nhttps://www.bugsnag.com/\n\nCopyright (c) Bugsnag\n\nPermission is hereby granted, free of charge, to any person obtaining\na copy of this software and associated documentation files (the \"Software\"),\nto deal in the Software without restriction, including without limitation\nthe rights to use, copy, modify, merge, publish, distribute, sublicense,\nand/or sell copies of the Software, and to permit persons to whom the Software\nis furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in\n all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\nOUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\nTHE SOFTWARE.\n\n\nFirebase Unity Open Source Development / Apache License, version 2.0\n--------------------------------------------------------------------\nhttps://github.com/firebase/firebase-unity-sdk\n\nCopyright (c) 2018 Google LLC\n\nLicensed under the Apache License, Version 2.0 (the \"License\");\nyou may not use this file except in compliance with the License.\nYou may obtain a copy of the License at\n\n   http://www.apache.org/licenses/LICENSE-2.0\n\nUnless required by applicable law or agreed to in writing, software\ndistributed under the License is distributed on an \"AS IS\" BASIS,\nWITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\nSee the License for the specific language governing permissions and\nlimitations under the License.\n\n\nMathematics / Unity Companion License\n-------------------------------------\nhttps://docs.unity3d.com/ja/2019.4/Manual/com.unity.mathematics.html\n\ncom.unity.mathematics copyright © 2019 Unity Technologies\n\nLicensed under the Unity Companion License for Unity-dependent projects (see https://unity3d.com/legal/licenses/unity_companion_license). Unless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nPost Processing Stack v2 / Unity Companion License\n--------------------------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.postprocessing@3.0/manual/index.html\n\ncom.unity.postprocessing copyright © 2020 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nTextMesh Pro / Unity Companion License\n--------------------------------------\nhttps://docs.unity3d.com/ja/2019.4/Manual/com.unity.textmeshpro.html\n\nTextMesh Pro copyright © 2014-2019 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nTimeline / Unity Companion License\n----------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.timeline@1.0/manual/index.html\n\nTimeline copyright © 2020 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nUniversal Render Pipeline / Unity Companion License\n---------------------------------------------------\nhttps://docs.unity3d.com/Packages/com.unity.render-pipelines.universal@7.3/manual/index.html\n\nUniversal Render Pipeline copyright © 2019 Unity Technologies ApS\n\nLicensed under the Unity Companion License for Unity-dependent projects--see Unity Companion License.\n\nUnless expressly provided otherwise, the Software under this license is made available strictly on an “AS IS” BASIS WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED. Please review the license for details on these and other terms and conditions.\n\n\nSpecial Thanks：Fontworks Inc.\n\n\nApache License Full Text\n========================\n                                 Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"[]\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright [yyyy] [name of copyright owner]\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       http://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\n   limitations under the License.\n\n\nRust for Windows / MIT License\n------------------------------\nhttps://github.com/microsoft/windows-rs/blob/master/license-mit\n\n    Copyright (c) Microsoft Corporation.\n\n    Permission is hereby granted, free of charge, to any person obtaining a copy\n    of this software and associated documentation files (the \"Software\"), to deal\n    in the Software without restriction, including without limitation the rights\n    to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n    copies of the Software, and to permit persons to whom the Software is\n    furnished to do so, subject to the following conditions:\n\n    The above copyright notice and this permission notice shall be included in all\n    copies or substantial portions of the Software.\n\n    THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n    IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n    FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n    AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n    LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n    OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE\n    SOFTWARE"
        },
        {
            "id": 702098,
            "value": "*Changing this setting will restart the app."
        },
        {
            "id": 702099,
            "value": "<align=\"center\">TERMS OF SERVICE</align>\n<align=\"center\">(FINAL FANTASY VII EVER CRISIS)</align>\n\nPLEASE READ THESE TERMS OF SERVICE CAREFULLY.\n\nTHESE TERMS OF SERVICE SET FORTH THE LEGALLY BINDING TERMS AND CONDITIONS FOR YOUR USE OF THE APPLICATION AND SERVICES.\n\nWelcome\n\nWelcome! Unless otherwise stated, the application set forth above (the “Application”) and the services provided by or on behalf of us in connection with the Application (collectively, the “Services”) are provided by Square Enix Co., Ltd. (“Company,” “we,” “us” or “our”) from Japan. These Terms of Service and any Additional Terms (defined below) thereof (collectively, the “TOS”) govern your use of the Services, regardless of how you access or use it and where you are located. By using the Services, you acknowledge and accept our Privacy Policy and consent to the collection, storage, sharing, and use of your data in accordance with the Privacy Policy. If you change your mind, you must immediately uninstall the Application and/or discontinue the use of the Services. By installing the Application and/or using the Services, you further agree that we may change, alter, or modify the settings or configurations on your Device (defined below) in order to allow or optimize your use of the Services.\n\nOverview\n\nThese TOS explain the terms and conditions under which you agree to use the Services. Here are some key points covered by these TOS:\n\n• These TOS apply when you use the Services. Any updates to the TOS will also apply to you. If you do not agree, or want to end your agreement with us, you must uninstall the Application or discontinue use of the Services.\n\n• You may only use the Content (defined below) contained in the Services in connection with your permitted activities on the Services and not in an offline environment or in connection with another application or web site unless we explicitly permit it. \n\n• You have no ownership in the Services or any virtual currency or virtual items used in the Services. You have only a limited license to use them pursuant to these TOS. All or part of the virtual currency or virtual items may be deleted or the operation of the Services may be terminated in our sole discretion, with or without notice to you. \n\n• Except as set forth explicitly in our Privacy Policy, you and the Company do not have a confidential relationship due to your use of the Services or your communications to us through or related to the Services. You and the Company do not have a fiduciary or other special relationship.\n\n• Many types of disputes that may arise in connection with your access to and use of the Services are subject to the exclusive jurisdiction of the Tokyo District Court located in Tokyo, Japan.\n\n• The Company is providing the Services to you on an \"as-is\" basis, without any warranty of any kind, and our liability to you in connection with your use of the Services is very limited. There are many other limitations and disclaimers relating to your use of the Services. \n\nIf You Want to Use The Services\n\nCarefully read the terms under these TOS, as they constitute a written agreement between you and us which affects your legal rights and obligations. It is important that you read and understand these complete TOS before using the Services. If you are a minor, you may only use the Services upon your parent or guardian's consent to these TOS.\n\nEach time you access and/or use the Services, you agree to be bound by and comply with all of the terms of the TOS that are posted on the Services, or linked to from the Services, at that time. Therefore, if you do not agree to all of the terms under these TOS, then you may not use the Services. You must uninstall the Application and discontinue use of the Services in order to end your agreement to these TOS.\n\nThe business realities associated with operating the Services are such that, without the limitations set forth in these TOS we would not be able to make the Services available to you.\n\nIn some instances, separate guidelines, rules, or terms of service or sale setting forth additional or different terms and/or conditions for the Services will also apply to your use of the Services (in each such instance, and collectively, \"Additional Terms\"). To the extent there is a conflict between the TOS and any Additional Terms, the Additional Terms will control unless the Additional Terms expressly state otherwise. \n\n\nFull Details of the Terms of Service\n\n1. Content, Ownership, Limited License, and Rights of Others.\n\nA. Content. The Services contain a variety of: (i) materials and other items, including, all layout, information, text, data, files, images, scripts, designs, graphics, button icons, instructions, illustrations, photographs, audio clips, music, sounds, pictures, videos, advertising copy, URLs, technology, software, interactive features, the \"look and feel\" of the Services, and the compilation, assembly, and arrangement of the materials of the Services and any and all copyrightable material (including source and object code); (ii) trademarks, logos, trade names, service marks, and trade identities of various parties; and (iii) other forms of intellectual property (all of the foregoing, collectively the \"Content\").\n\nB. Ownership. The Services (including past, present, and future versions) and the Content are owned or controlled by us, and/or our licensors and certain other third parties. All rights, titles, and interests in and to the Content available via the Services are the property of the Company and/or our licensors or certain other third parties, and is protected by Japanese, U.S. and international copyright, trademark, patent, or other intellectual property rights and laws to the fullest extent possible. The Company owns the copyright in the selection, compilation, assembly, arrangement, and enhancement of the Content on the Services.\n\nC. Limited License. Subject to your strict compliance with these TOS, the Company grants you a limited, non-exclusive, revocable, non-assignable, personal, and non-transferable license to download (subject to any restrictions), display, view, use, and/or play the Content (excluding source and object code in raw form or otherwise, other than as made available to access and use via a standard display technology) on the devices compatible with the Services (each, a \"Device\") for your personal, non-commercial use only, and, for certain Services. The foregoing limited license (i) does not give you any ownership of, or any other intellectual property interest in, any Content, and (ii) may be immediately suspended or terminated for any reason or no reason, in our sole discretion, and without advance notice or liability. \n\nD. Rights of Others. In using the Services, you must respect the intellectual property and other rights of the Company and others. Your unauthorized use of the Content may violate copyright, trademark, privacy, publicity, communications, and other laws, and any such use may result in your personal liability, including potential criminal liability. We respect the intellectual property rights of others.\n\n2. Services and Content Use Restrictions.\n\nA. Services Use Restrictions. You agree that you will not, and you will not assist other users: \n\n(a) post, transmit, promote or distribute illegal content or content that you do not own or do not have the right to freely distribute;\n\n(b) use the Services for any commercial purpose (including, without limitation, for purposes of advertising, soliciting funds, collecting product prices, using the Services in internet cafes and selling products); \n\n(c) engage in any activities through or in connection with the Services that seek to attempt to or do harm, harass, threaten, abuse, disparage, libel, slander, or embarrass any individuals or entities;\n\n(d) engage in any activities through or in connection with the Services that are unlawful, fraudulent, offensive, vulgar, sexually explicit, obscene, lewd, lascivious, filthy, violent, threatening, harassing, defamatory, infringing, invasive of personal privacy or publicity rights, or abusive, or that violate any right of the Company or any third party, or are, in a reasonable person’s view, objectionable; \n\n(e) submit, publish, post or display child pornography, promote, encourage or advocate the production, preparation or consumption of illicit or prescription drugs, promote or encourage suicide, or attempts at suicide, advocate a political position or on behalf of political candidate or political party, or promote the interests of any particular religion or religious groups;\n\n(f) alter, delete or cancel any other user’s profile information or content;\n\n(g) attempt to get a user ID, password, or other user information, or any other private information from a user;\n\n(h) reverse engineer, decompile, disassemble, reverse assemble, hack, crack, or modify the Services source or object code or any software or other products, services, or processes accessible through any portion of the Services; \n\n(i) engage in any activity that interferes with a user's access to the Services or the proper operation of the Services, or otherwise causes harm to the Services, the Company, or other users of the Services; \n\n(j) interfere with or circumvent any security feature of the Services or any feature that restricts or enforces limitations on use of or access to the Services, the Content, or the User-Generated Content; \n\n(k) create, operate, participate in or use any unauthorized servers intended to emulate the Services; \n\n(l) use or distribute “auto” software programs, “macro” software programs or other “cheat utility” software program or applications;\n\n(m) exploit any bug or vulnerability in the Services or in any product of the Company to gain unfair advantage. You agree not to communicate the existence of any such bug (either directly or through the public posting) to any other user or third party;\n\n(n) use the Services in the devises that are not compatible with the Services;\n\n(o) set up, operate, participate or use unauthorized private servers for the Services\n\n(p) intercept, mine or otherwise collect information from the Services using unauthorized third-party software; \n\n(q) modify, reproduce, distribute, delete or make any derivative works of the Content provided in the Services unless the Company expressly authorizes such actions; \n\n(r) do anything that interferes with the proper functioning of the Services, the ability of other users to enjoy the Services or that materially increases the expense or difficulty of the Company in maintaining the Services for enjoyment of all its users;\n\n(s) make false report to the Company;\n\n(t) solicit or attempt to solicit, and post or communicate any user’s personal information without such user’s content;\n\n(u) unless otherwise provided in the Additional Terms, share your account information and log in information with other person;\n\n(v) hold multiple user accounts;\n\n(w) impersonate other person, indicate that you are an employee or agent of the Company (or its affiliates), or attempt to mislead users by indicating that you represent Company or any of Company’s licensors or affiliates; or\n\n(x) act in a way that the Company deems inappropriate or otherwise violate these TOS.\n\nB. Real-Money Trading (\"RMT\"). RMT activities are strictly forbidden. If you sell, or attempt to sell, any virtual items or virtual currencies obtained or used via the Services, including any account held by you, you may be banned for violation of these TOS. Any solicitation for sales shall be treated as a breach of these TOS.\n\nC. Content Use Restrictions. You also agree that, in using the Content (other than your User-Generated Content that does not contain any elements licensed by us): (i) you will not monitor, gather, copy, or distribute such Content (except as may be a result of standard search engine activity or use of a standard browser) on the Services by using any robot, rover, \"bot\", spider, scraper, crawler, spyware, engine, device, software, extraction tool, or any other automatic device, utility, or manual process of any kind; (ii) you will not frame or utilize framing techniques to enclose any such Content (including any images, text, or page layout); (iii) you will keep intact all trademark, copyright, and other intellectual property notices contained in such Content; (iv) you will not use such Content in a manner that suggests an unauthorized association with the Company or any of our or our licensors' products, services, or brands; (v) you will not make any modifications to such Content (other than to the extent of your permitted use of such Content, if applicable); (vi) you will not modify, reproduce, archive, sell, lease, rent, exchange, create derivative works from, publish by hard copy or electronic means, publicly perform, display, disseminate, distribute, broadcast, retransmit, circulate to any third party or on any third-party application or website, or otherwise use or exploit such Content in any way for any purpose except as specifically permitted by these TOS; and (vii) you will not insert any code or product to manipulate such Content in any way that adversely affects any user experience.\n\nD. Availability of Services and Content. We may immediately suspend or terminate the availability of the Services and Content (and any elements and features of them) for any reason, in our sole discretion, without advance notice or liability. We further have the right to obtain, without notification to you, information from your computer and software, including without limitation, your computer's random access memory, video card, central processing unit, hard drive(s), and any other storage devices to assist our efforts in policing users who may develop and/or use \"hacks\" or \"cheats\" to profit or to gain advantage over other users. Information obtained under this Section will only be used for the purpose of identifying persons or entities not in compliance or believed by us to not be in compliance with these TOS.\n\nE. Reservation of All Rights Not Granted as to Content and Services. These TOS include only narrow, limited grants of rights to Content and to use and access the Services. No right or license may be construed, under any legal theory, by implication, estoppel, industry custom, or otherwise. All rights not expressly granted to you are reserved by the Company and its licensors and other third parties. Any unauthorized use of any Content or the Services for any purpose is prohibited.\n\n3. Opening and Terminating Accounts.\n\nIn order to access or use some (or potentially all) of the features on the Services, you may be required to register through the Services or a third-party tool (such as Facebook).\n\nIf you register for any feature that requires a password and/or username, then you will select your own password at the time of registration (or we may send you an e-mail notification with a randomly generated initial password) and you agree that: (i) You will not use a username (or e-mail address) that is already being used by someone else, may impersonate another person, belongs to another person, violates the intellectual property or other right of any person or entity, or is offensive. We may reject the use of any password, username, or e-mail address for any other reason in our sole discretion; (ii) You will provide accurate, current, and complete registration information about yourself in connection with the registration process and, as permitted, to maintain and update it continuously and promptly to keep it accurate, current, and complete; (iii) You are solely responsible for all activities that occur under your account, password, and username – whether or not you authorized the activity; (iv) You are solely responsible for maintaining the confidentiality of your password and for restricting access to your device so that others may not access any password-protected portion of the Services using your name, username, or password; (v) Unless expressly provided by us, you will not own multiple accounts; (vi) You will immediately notify us of any unauthorized use of your account, password, or username, or any other breach of security; and (vi) You will not sell, transfer, or assign your account or any account rights.\n\n4. Virtual Currency.\n\nThe following policies govern the virtual currency (\"Virtual Currency\") offered by us to its customers using the Services.\n\nA. Introduction to the Virtual Currency. Virtual Currency may be redeemed by you for certain licensed digital items and online services in the Services.\n\nB. Virtual Currency Are Merely Licensed Virtual Goods and Have No Monetary Value. Virtual Currency (and virtual items and services they may be redeemed for) are virtual goods licensed to users and owned at all times by the Company. The license may be revoked by the Company at any time in our discretion. Virtual Currency (and virtual items and services they may be redeemed for) have no monetary value, and you do not have any personal property rights in the Virtual Currency (or virtual items and services they may be redeemed for). Therefore, Virtual Currency (and virtual items and services they may be redeemed for) may not be traded for cash, currency or any form of property, license or rights except for the products and services that the Company chooses to offer you in its sole discretion. You may not transfer Virtual Currency (or virtual items and services they may be redeemed for) to any other person or entity or receive Virtual Currency (or virtual items and services they may be redeemed for) from any other person or entity for any reason unless explicitly authorized by the Company. Virtual Currency (and virtual items and services they may be redeemed for) may be deleted by the Company for any reason or no reason, with or without notice.\n\nC. Pricing and Purchasing. You may add Virtual Currency to your account by using the payment methods specified for the particular platform you are using to access the Services. You must be authorized to use the payment method chosen and, in the case of minors using a credit or debit card of a parent or guardian, your parent or guardian must expressly agree to allow the use of such payment method. The current prices for Virtual Currency will be available for viewing in the Services. The Company reserves the right to adjust the price for Virtual Currency at any time, in its sole discretion, without notice or reimbursement. You are responsible for the payment of any taxes or other charges relating to the purchase or redemption of Virtual Currency. You may not falsely notify your payment processor that you did not authorize any one-time or automatically recurring charge that you consented to previously. We reserve the right to ban those who commit \"friendly fraud\" from the Services.\n\nD. Limits. In order to protect your security and to deter fraud, the Company may impose limits on the amount of Virtual Currency that you may license per transaction, per day and/or per month. The Company may also limit the maximum amount of Virtual Credits Currency that you may hold in your account at any one time.\n\nE. Usage of Virtual Currency. You may redeem Virtual Currency for certain digital items and/or online services offered within the Services. Such digital items are also revocable licenses for which you have no property interest, and which may be discontinued or deleted at any time. The Company reserves the right to adjust the amount of Virtual Currency due for each digital item and online service at any time, in its sole discretion, without notice or reimbursement. Once redeemed, Virtual Currency will be deducted from your account balance and cannot be used again. You have no right to reverse a transaction once it is completed. However, if the Company determines that an incorrect price (in Virtual Currency) is identified for a digital item or online service, it reserves the right to reverse, adjust and/or nullify any such transaction.\n\nF. NO CASH REFUNDS. EXCEPT AS REQUIRED BY LAW OR AN APPROPRIATE PLATFORM OWNER, YOU HAVE NO RIGHT TO RECEIVE A CASH REFUND FOR UNUSED VIRTUAL CURRENCY. \n\nG. Expiration of Virtual Currency. Virtual Currency issued by the Company currently do not expire, but the Company reserves the right to alter or terminate operation of the Services, any Virtual Currency, and to revoke the licenses to them, at any time without notice. In other words, you may redeem Virtual Currency for as long as the Company chooses to make Virtual Currency redeemable for digital items and services, which the Company has no obligation to do. Accordingly, we encourage you to redeem Virtual Currency sooner rather than later.\n\nH. Improper Acquisition/Usage of Virtual Currency. You agree that the Company has the absolute right to manage and regulate the Virtual Currency and all licenses for digital items and services related thereto in its sole discretion. If the Company suspects any fraudulent, abusive or unlawful activity with respect to your Virtual Currency balance, or your acquisition of licensed digital items or Services associated therewith, then the Company may reduce or liquidate your Virtual Currency balance and/or any or all licenses for digital items and Services related thereto, or deactivate, suspend or terminate access thereto.\n\nI. Termination of　Account. If you (a) are banned for any reason, including violation of these TOS, or (b) voluntarily terminate your account, then the Company reserves the right to delete the account and all Virtual Currency and all licenses for items and services related thereto permanently.\n\nJ. Changes to the Virtual Currency. We reserve the right to change the way that the Virtual Currency and all licenses for items and services related thereto operates, or to terminate the Virtual Credits System and all licenses for items and services related thereto altogether, at any time, in its sole discretion, without notice. Any such changes shall take effect immediately upon posting of the change.\n\nK. VIRTUAL CURRENCY WAIVER. BY ACCEPTING THESE TOS OR BY USING THE VIRTUAL CURRENCY, YOU AGREE NOT TO ASSERT OR BRING ANY CLAIM OR SUIT AGAINST THE COMPANY, ITS PARENTS OR AFFILIATES, ITS BACK-END SERVICE PROVIDERS, THE PLATFORM LICENSORS, OR THEIR EMPLOYEES, ARISING OUT OF OR RELATED TO VIRTUAL CURRENCY, INCLUDING BUT NOT LIMITED TO, ANY CLAIM WHICH IS BASED ON A THEORY THAT YOU \"OWN\" VIRTUAL CURRENCY (OR ANY VIRTUAL ITEMS OR SERVICES), OR THAT YOU LOST THE \"VALUE\" OF VIRTUAL CURRENCY (OR ANY VIRTUAL ITEMS OR SERVICES) AS A RESULT OF VIRTUAL CURRENCY (OR ANY VIRTUAL ITEMS OR SERVICES) DELETION OR ACCOUNT TERMINATION, OR FOR ANY MODIFICATIONS IN THE AMOUNT OF VIRTUAL CURRENCY REQUIRED TO ACCESS CERTAIN VIRTUAL ITEMS OR SERVICES, OR THE REMOVAL OF ACCESS TO VIRTUAL CURRENCY (OR ANY VIRTUAL ITEMS OR SERVICES), OR FOR ANY MALFUNCTIONS AND/OR \"BUGS\" IN ANY VIRTUAL CURRENCY (OR ANY VIRTUAL ITEMS OR SERVICES).\n\nL. Issuance of Virtual Currency. The Company will be the sole issuing authority for Virtual Currency for the Services and Virtual Currency licensed from the Company hereunder may only be used by registered users of the Services for the redemption of virtual items or services offered in the Services.\n\n5. Content You Submit.\n\nA. User-Generated Content General. The Company may now or in the future offer users of the Services the opportunity to create, build, post, upload, display, publish, distribute, transmit, broadcast, or otherwise make available on or submit through the Services (collectively, \"Submit\") messages, avatars, text, illustrations, files, images, graphics, photos, comments, sounds, music, videos, information, content, ratings, reviews, data, questions, suggestions, personally identifiable information, or other information or materials and the ideas contained therein (collectively, but excluding the Content included therein, \"User-Generated Content\"). The Company may do this through forums, blogs, message boards, social networking environments, content creation tools, gameplay, social communities, e-mail, messaging and other communications functionality. Subject to the rights and license you grant in these TOS, you retain whatever legally cognizable right, title, and interest that you have in your User-Generated Content, except to the extent it incorporates copyrighted materials of the Company (for example, you incorporated one of our characters or logos).\n\nB. Non-Confidentiality of Your User-Generated Content. You agree that (a) your User-Generated Content will be treated as non-confidential – regardless of whether you mark them \"confidential, \" \"proprietary, \" or the like – and will not be returned, and (b) the Company does not assume any obligation of any kind to you or any third party with respect to your User-Generated Content. You acknowledge that Internet and mobile communications may be subject to breaches of security and that you are aware that submissions of User-Generated Content may not be secure, and you will consider this before submitting any User-Generated Content and do so at your own risk.\n\nC. Unsolicited Ideas and Materials. In your communications with the Company, please keep in mind that the Company does not seek any unsolicited ideas or materials for products or services, or even improvements to products or services, such as ideas, concepts, inventions, or designs for game productions or equipment, books, scripts, screenplays, motion pictures, television shows, theatrical productions, or otherwise (collectively, \"Unsolicited Ideas and Materials\"). Any Unsolicited Ideas and Materials you post on or send to us via the Services are deemed User-Generated Content and licensed to us as set forth below and pursuant to our Unsolicited Materials Policy set forth on our website here. In addition, the Company retains all of the rights held by members of the general public with regard to your Unsolicited Ideas and Materials. The receipt of your Unsolicited Ideas and Materials by the Company is not an admission by the Company of their novelty, priority, or originality, and it does not impair the right of the Company to contest existing or future intellectual property rights relating to your Unsolicited Ideas and Materials.\n\nD. License to The Company of Your User-Generated Content. Except as otherwise described in any Additional Terms (such as official contest rules), which govern the submission of your User-Generated Content, you hereby grant to the Company and its affiliates, and you agree to grant to the Company and its affiliates on a prospective basis, the non-exclusive, unrestricted, unconditional, unlimited, worldwide, irrevocable, perpetual, and cost-free right and license to use, copy, record, distribute, reproduce, disclose, sell, re-sell, sublicense (through multiple levels), display, publicly perform, transmit, publish, broadcast, translate, make derivative works of, and otherwise use and exploit in any manner whatsoever, all or any portion of your User-Generated Content (and derivative works thereof), for any purpose whatsoever in all formats, on or through any media, software, formula, or medium now known or hereafter developed, and with any technology or devices now known or hereafter developed, and to advertise, market, and promote the same. Without limitation, the granted rights include the right to: (a) configure, host, index, cache, archive, store, digitize, compress, optimize, modify, reformat, edit, adapt, publish in searchable format, and remove such User-Generated Content and combine same with other materials, and (b) use any ideas, concepts, know-how, or techniques contained in any User-Generated Content for any purposes whatsoever, including developing, producing, and marketing products and/or services. In order to further effect the rights and license that you grant to the Company to your User-Generated Content, you also hereby grant to the Company and its affiliates, and agree to grant to the Company and its affiliates on a prospective basis, the unconditional, perpetual, irrevocable right to use and exploit your name, persona, and likeness in connection with any User-Generated Content, without any obligation or remuneration to you. Except as prohibited by law, you hereby waive, and you agree to waive, any moral rights (including attribution and integrity) that you may have in any User-Generated Content, even if it is altered or changed in a manner not agreeable to you. To the extent not waivable, you irrevocably agree not to exercise such rights (if any) in a manner that interferes with any exercise of the granted rights. You understand that you will not receive any fees, sums, consideration, or remuneration for any of the rights granted in this Section. Upon the Company’s request, you will furnish us with any documentation necessary to substantiate the rights to such content and to verify your compliance with these TOS.\n\nE. Exclusive Right to Manage the Services. The Company may, but will not have any obligation to, review, monitor, display, post, store, maintain, accept, or otherwise make use of any of your User-Generated Content to ensure appropriate use of the Services, and the Company may in the course of managing the Services as we deem appropriate, delete, move, re-format, remove or refuse to post or otherwise make use of User-Generated Content without notice, or restore any credits or virtual items used in the creation of such deleted User Generated Content to you, or have any liability to you or any third party in connection with our operation of User-Generated Content venues in an appropriate manner. Without limitation, the Company may do so to address content that comes to our attention that the Company believes is offensive, obscene, lewd, lascivious, filthy, violent, harassing, threatening, abusive, illegal or otherwise objectionable or inappropriate, or to enforce the rights of third parties or these TOS. Such User-Generated Content submitted by you or others need not be maintained on the Services by us for any period of time and you will not have the right, once submitted, to access, archive, maintain, or otherwise use such User-Generated Content on the Services or elsewhere.\n\nF. Representations and Warranties Related to Your User-Generated Content. Each time you submit any User-Generated Content, you represent and warrant that you are either at least the age of majority in the jurisdiction in which you reside or have all proper consents from your parent or legal guardian, and that, as to that User-Generated Content, (a) you are the sole author and owner of the intellectual property and other rights to the User-Generated Content, or you have a lawful right to submit the User-Generated Content and grant the Company the rights to it that you are granting by these TOS, all without any obligation of the Company to obtain consent of any third party and without creating any obligation or liability of the Company; (b) the User-Generated Content is accurate; (c) the User-Generated Content does not and, as to the permitted uses and exploitation set forth in these TOS, will not infringe any intellectual property or other right of any third party; and (d) the User-Generated Content will not violate these TOS, or cause injury or harm to any person.\n\nG. Enforcement. The Company has no obligation to monitor or enforce your intellectual property rights to your User-Generated Content, but you grant us the right to protect and enforce our rights to your User-Generated Content, including by bringing and controlling actions in your name and on your behalf (at our cost and expense, to which you hereby consent and irrevocably appoint the Company as your attorney-in-fact, with the power of substitution and delegation, which appointment is coupled with an interest).\n"
        },
        {
            "id": 702100,
            "value": "6. Linked-To Services, Websites; Advertisements; Dealings with Third Parties.\n\nA. Linked Locations; Advertisements. The Services may contain links, as part of third-party ads on the Services or otherwise, to or from third-party web sites, applications or other locations (\"Linked Sites\"), including those operated by advertisers, licensors, licensees, and certain other third parties who may have business relationships with the Company. The Company may have no control over the content, operations, policies, terms, or other elements of Linked Sites, and the Company does not assume any obligation to review any Linked Sites. The Company does not endorse, approve, or sponsor any Linked Sites, or any third-party content, advertising, information, materials, products, services, or other items. Furthermore, the Company is not responsible for the quality or delivery of the products or services offered, accessed, obtained by or advertised at such Linked Sites. Finally, the Company will under no circumstances be liable for any direct, indirect, incidental or special loss or other damage, whether arising from negligence, breach of contract, defamation, infringement of copyright or other intellectual property rights, caused by the exhibition, distribution or exploitation of any information or content contained within the Linked Sites. Any activities you engage in connection with any of the same are subject to the privacy and other policies, terms and conditions of use, and rules issued by the operator of the Linked Sites. The Company disclaims all liability in connection therewith.\n\nB. Dealings with Third Parties. Any interactions, correspondence, transactions, and other dealings that you have with any third parties found on or through the Services (including on or via Linked Sites or advertisements) are solely between you and the third party (including issues related to the content of third-party advertisements, payments, delivery of goods, warranties (including product warranties), privacy and data security, and the like). The Company disclaims all liability in connection with therewith.\n\nC. Terms Applicable if Accessing the Services Through an Apple iOS Device. If you are accessing or using the Services through an Apple device running iOS, the following additional terms and conditions (\"Apple Terms\") are applicable to you and are incorporated into these TOS by this reference:\n\ni. To the extent that you are accessing the Services through an Apple iOS device, you acknowledge that these Apple Terms are entered into between you and the Company and, that Apple, Inc. (\"Apple\") is not a party to these Apple Terms other than as third-party beneficiary as contemplated below.\n\nii. The license granted to you in Section 1 of these TOS is subject to the permitted Usage Rules set forth in the App Store Terms of Service and any third-party terms of agreement applicable to the Services.\n\niii. You acknowledge that the Company, and not Apple, is responsible for providing the Services and Content thereof.\n\niv. You acknowledge that Apple has no obligation whatsoever to furnish any maintenance or any support services to you with respect to the Services.\n\nv. To the maximum extent permitted by applicable law, Apple will have no other warranty obligation whatsoever with respect to the Services.\n\nvi. Notwithstanding anything to the contrary herein, and subject to the terms in these TOS, you acknowledge that, solely as between Apple and the Company, the Company and not Apple is responsible for addressing any claims you may have relating to the Services, or your possession and/or use thereof, including, but not limited, to: (1) product liability claims, (2) any claim that the Services fails to confirm to any applicable legal or regulatory requirement; and (3) claims arising under consumer protection or similar legislation.\n\nvii. Further, you agree that if the Services, or your possession and use of the Services, infringes on a third-party's intellectual property rights, you will not hold Apple responsible for the investigation, defense, settlement and discharge of any such intellectual property infringement claims.\n\nviii. You acknowledge and agree that Apple, and Apple's subsidiaries, are third-party beneficiaries of these TOS, and that, upon your acceptance of the terms and conditions of these TOS, Apple will have the right (and will be deemed to have accepted the right) to enforce these TOS against you as a third-party beneficiary thereof.\n\nix. When using the Services, you agree to comply with any and all third-party terms that are applicable to any platform, website, technology or service that interacts with the Services.\n\n7. Wireless and Location-based Services.\n\nA. Wireless Features. The Services may offer features and services that are available to you via your wireless Device. These features and services may include the ability to access the features of the Services and upload content to the Services, receive messages from the Services, and download applications to your wireless Device (collectively, \"Wireless Features\"). Standard messaging, data, and other fees may be charged by your carrier to participate in Wireless Features. Fees and charges may appear on your wireless bill or be deducted from your pre-paid balance. Your carrier may prohibit or restrict certain Wireless Features and certain Wireless Features may be incompatible with your carrier or wireless Device. You should check with your carrier to find out what plans are available and how much they cost. Contact your carrier with questions regarding these issues.\n\nB. Terms of Wireless Features. You agree that, as to the Wireless Features for which you are registered, we may send communications to your wireless Device regarding us or other parties. Further, we may collect information related to your use of the Wireless Features. If you have registered via the Services for Wireless Features, then you agree to notify the Company of any changes to your wireless contact information (including phone number) and update your accounts on the Services to reflect the changes.\n\n8. Disputes.\n\nA. Governing Law and Venue. The Services are made accessible, operated and controlled by the Company. The laws of Japan, without regard to conflicts of law provisions, will apply to all matters arising out of or in connection with the Services and your access and use thereof. By accessing and using the Services, you submit and consent to the exclusive jurisdiction of the Tokyo District Court located in Tokyo, Japan as the court of first instance with respect to any dispute or cause of action (whether contractual or non-contractual) arising out of or in connection with these TOS and/or your access and use of the Services.\n\nB. Dispute Among the Users. You are solely responsible for your interactions with other users of the Services. If you have a dispute with one or more users of the Services, in addition to any other remedies available to the Company, the Company (and its licensors, affiliates, employees, officers, directors, contractors, agents, third party suppliers, licensors and third party partners) shall not be liable for claims, demands and damages (direct and indirect) of every kind and nature, known or unknown, arising out of or in connection with such disputes. If you are a resident of the State of California, the United States, you waive the rights afforded to you under California Civil Code §1542.\n\nC. Limited Time to File Claims. TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IF YOU WANT TO ASSERT A DISPUTE AGAINST THE COMPANY, THEN YOU MUST COMMENCE IT WITHIN ONE (1) YEAR AFTER THE DISPUTE ARISES, OR ELSE IT SHALL BE FOREVER BARRED.\n\nD. Injunctive Relief. The foregoing provisions of this Section 8 will not apply to any legal action taken by the Company to seek an injunction or other equitable relief in connection with, any loss, cost, or damage (or any potential loss, cost, or damage) relating to the Services, any Content, your User-Generated Content and/or the Company’s intellectual property rights, the Company’s operations, and/or the Company’s products or services (collectively, \"Excluded Dispute\").\n\n9. DISCLAIMER OF REPRESENTATIONS AND WARRANTIES.\n\nYOUR ACCESS TO AND USE OF THE SERVICES IS AT YOUR SOLE RISK.\n\nTHE SERVICES ARE PROVIDED ON AN \"AS IS\", \"AS AVAILABLE\", AND \"WITH ALL FAULTS\" BASIS. Therefore, to the fullest extent permissible by law, the Company and its parents, affiliates, subsidiaries and each of their respective employees, directors, members, managers, shareholders, agents, vendors, licensors, licensees, contractors, customers, successors, and assigns (collectively, \"Company Parties\") hereby disclaim and make no representations, warranties, endorsements, or promises, express or implied, as to:\n\ni. the Services (including the Content and the User-Generated Content);\n\nii. the functions, features, or any other elements on, or made accessible through, the Services;\n\niii. any products, services, or instructions offered or referenced at or linked through the Services;\n\niv. security associated with the transmission of your User-Generated Content transmitted to the Company or via the Services;\n\nv. whether the Services or the servers that make the Services available are free from any harmful components (including viruses, Trojan horses, and other technologies that could adversely impact your Device);\n\nvi. whether the information (including any instructions) on the Services is accurate, complete, correct, adequate, useful, timely, or reliable;\n\nvii. whether any defects to the Services will be repaired; and\n\nviii. whether your use of the Services is lawful in any particular jurisdiction.\n\nEXCEPT FOR ANY SPECIFIC WARRANTIES PROVIDED HEREIN OR IN ADDITIONAL TERMS PROVIDED BY A COMPANY PARTY, THE COMPANY PARTIES HEREBY FURTHER DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NON-INFRINGEMENT OR MISAPPROPRIATION OF INTELLECTUAL PROPERTY RIGHTS OF THIRD PARTIES, TITLE, CUSTOM, TRADE, QUIET ENJOYMENT, SYSTEM INTEGRATION, AND FREEDOM FROM COMPUTER VIRUS.\n\nSome jurisdictions limit or do not allow the disclaimer of implied or other warranties so the above disclaimers may not apply to the extent such jurisdictions' laws are applicable.\n\n10. LIMITATIONS OF LIABILITY OF COMPANY PARTIES.\n\nUNDER NO CIRCUMSTANCES WILL ANY COMPANY PARTIES BE RESPONSIBLE OR LIABLE FOR ANY LOSS OR DAMAGES OF ANY KIND, including personal injury or death or for any direct, indirect, economic, exemplary, special, punitive, incidental, or consequential losses or damages that are directly or indirectly related to:\n\ni. the Services (including the Content and the User-Generated Content);\n\nii. your use of or inability to use the Services, or the performance of the Services;\n\niii. any action taken in connection with an investigation by the Company Parties or law enforcement authorities regarding your access to or use of the Services;\n\niv. any action taken in connection with copyright or other intellectual property owners or other rights owners;\n\nv. any errors or omissions in the Services' technical operation; or\n\nvi. any damage to any user's computer, hardware, software, modem, or other equipment or technology, including damage from any security breach or from any virus, bugs, tampering, fraud, error, omission, interruption, defect, delay in operation or transmission, computer line, or network failure or any other technical or other malfunction, including losses or damages in the form of lost profits, loss of goodwill, loss of data, work stoppage, accuracy of results, or equipment failure or malfunction.\n\nThe foregoing limitations of liability will apply even if any of the foregoing events or circumstances were foreseeable and even if the Company Parties were advised of or should have known of the possibility of such losses or damages, regardless of whether you bring an action based in contract, negligence, strict liability, or tort (including whether caused, in whole or in part, by negligence, acts of god, telecommunications failure, or destruction of the Services).\n\nSome jurisdictions do not allow the exclusion or limitation of incidental or consequential damages of the sort that are described above, so the above limitation or exclusion may not apply to you.\n\nEXCEPT AS MAY BE PROVIDED IN ANY ADDITIONAL TERMS, TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT WILL THE COMPANY PARTIES' TOTAL LIABILITY TO YOU, FOR ALL POSSIBLE DAMAGES, LOSSES, AND CAUSES OF ACTION IN CONNECTION WITH YOUR ACCESS TO AND USE OF THE SERVICES AND YOUR RIGHTS UNDER THESE TOS, EXCEED AN AMOUNT EQUAL TO THE AMOUNT YOU HAVE PAID TO THE COMPANY IN CONNECTION WITH THE TRANSACTION(S) THAT UNDERLIE THE CLAIM(S); PROVIDED, HOWEVER, THIS PROVISION WILL NOT APPLY IF A TRIBUNAL WITH APPLICABLE JURISDICTION FINDS SUCH TO BE UNCONSCIONABLE. \n\n11. Waiver of Injunctive or Equitable Relief.\n\nIF YOU CLAIM THAT YOU HAVE INCURRED ANY LOSS, DAMAGES, OR INJURIES IN CONNECTION WITH YOUR USE OF THE SERVICES, THEN THE LOSSES, DAMAGES, AND INJURIES WILL NOT BE IRREPARABLE OR SUFFICIENT TO ENTITLE YOU TO AN INJUNCTION OR TO OTHER EQUITABLE RELIEF OF ANY KIND. THIS MEANS THAT, IN CONNECTION WITH YOUR CLAIM, YOU AGREE THAT YOU WILL NOT SEEK, AND THAT YOU WILL NOT BE PERMITTED TO OBTAIN, ANY COURT OR OTHER ACTION THAT MAY INTERFERE WITH OR PREVENT THE DEVELOPMENT OR EXPLOITATION OF ANY WEB SERVICES, CONTENT, USER-GENERATED CONTENT, PRODUCT, SERVICE, OR OTHER INTELLECTUAL PROPERTY OWNED, LICENSED, USED OR CONTROLLED BY THE COMPANY (INCLUDING YOUR LICENSED USER-GENERATED CONTENT) OR A LICENSOR OF THE COMPANY. UNDER NO CIRCUMSTANCES WILL YOU BE ENTITLED TO OBTAIN ANY INJUNCTIVE RELIEF OR OTHERWISE ENJOIN, RESTRAIN, OR OTHERWISE INTERFERE WITH THE DISTRIBUTION, OPERATION, DEVELOPMENT, OR PERFORMANCE OF THE SERVICES.\n\n12. General Provisions.\n\nA. Updates to TOS. The Company reserves the right to modify these TOS, at any time without prior notice (\"Updated Terms\"). You agree that we may notify you of the Updated Terms by posting them on the Services, and that your use of the Services after we post the Updated Terms (or engaging in such other conduct as we may reasonably specify) constitutes your agreement to the Updated Terms. Therefore, you should review these TOS each time you use the Services. The Updated Terms will be effective as of the time that the Company posts them on the Services, or such later date as may be specified in them.\n\nB. Consent or Approval of the Company. As to any provision in these TOS that grants the Company the right of consent or approval, or permits the Company to exercise the right in its \"sole discretion”, the Company may exercise that right in its sole and absolute discretion. No consent or approval of the Company may be deemed to have been granted by the Company without being in writing and signed by an authorized employee of the Company.\n\nC. Indemnity. You agree to, and you hereby, defend, indemnify, and hold the Company Parties harmless from and against any and all claims, damages, losses, costs, investigations, liabilities, judgments, fines, penalties, settlements, interest, and expenses (including attorneys' fees) that directly or indirectly arise from or are related to any claim, suit, action, demand, or proceeding made or brought against any Company Party, or on account of the investigation, defense, or settlement thereof, arising out of or in connection with, whether occurring heretofore or hereafter: (i) your User-Generated Content; (ii) your use of the Services and your activities in connection with the Services; (iii) your breach or anticipatory breach of these TOS; (iv) your violation or anticipatory violation of any laws, rules, regulations, codes, statutes, ordinances, or orders of any governmental or quasi-governmental authorities in connection with your use of the Services or your activities in connection with the Services; (v) information or material transmitted through your Device, even if not submitted by you, that infringes, violates, or misappropriates any copyright, trademark, trade secret, trade dress, patent, publicity, privacy, or other right of any person or entity; (vi) any misrepresentation made by you; and (vii) the Company Parties' use of the information that you submit to us (including your User-Generated Content) (all of the foregoing, \"Claims and Losses\"). You will cooperate as fully required by the Company Parties in the defense of any Claim and Losses. Notwithstanding the foregoing, the Company Parties retain the exclusive right to settle, compromise, and pay any and all Claims and Losses. The Company Parties reserve the right to assume the exclusive defense and control of any Claims and Losses. You will not settle any Claims and Losses without, in each instance, the prior written consent of an officer of the Company.\n\nD. Void Where Prohibited. The information provided through the Services are not intended for distribution to or use by any person in any jurisdiction or country where such distribution or use would be contrary to law or regulation or which would subject the Company to any registration requirement within such jurisdiction or country. The Company makes no representation or warranty that any material on the Services is lawful in every jurisdiction from which such Services can be accessed, or is available for use in all jurisdictions. If you access or use the Services from a jurisdiction outside Japan, you are responsible for compliance with all applicable laws.\n\nIF YOU ARE CONSIDERED TO BE A MINOR WHERE YOU RESIDE, YOU REPRESENT AND WARRANT THAT YOU HAVE YOUR LEGAL REPRESENTATIVE’S PERMISSION TO ACCESS AND USE THE SERVICES. IF YOU ARE A MINOR BUT DID NOT HAVE YOUR LEGAL REPRESENTATIVE’S PERMISSION TO THE ACCESS AND USE THE SERVICES, THE COMPANY MAY IMMEDIATELY (WITHOUT NOTICE) TERMINATE THE LICENSE GRANTED HEREUNDER.\n\nTHE SERVICES ARE INTENDED FOR USE BY PERSONS 13 AND ABOVE. BY ACCESSING AND USING THE SERVICES, YOU REPRESENT AND WARRANT THAT YOU ARE 13 OR OLDER, AND THAT YOU AGREE TO ABIDE BY ALL OF THE TERMS AND CONDITIONS OF THESE TOS. \n\nE. Severability. If any provision of these TOS is for any reason deemed invalid, unlawful, void, or unenforceable by a court or arbitrator of competent jurisdiction, then that provision will be deemed severable from these TOS, and the invalidity of the provision will not affect the validity or enforceability of the remainder of these TOS (which will remain in full force and effect). To the extent permitted by applicable law, you agree to waive, and you hereby waive, any applicable statutory and common law that may permit a contract to be construed against its drafter. Wherever the word \"including\" is used in these TOS, the word will be deemed to mean \"including, without limitation.\"\n\nF. Export Control. The Application may be subject to international rules that govern the export of software. You shall comply with all applicable international and national laws that apply to the Application as well as any applicable end-user, end-use and destination restrictions issued by national governments. By accessing and using the Application, you represent and warrant that you are not prohibited from receiving exports or services under applicable export laws.\n\nG. Communications. When you communicate with us electronically, such as via e-mail or text message, you consent to receive communications from us electronically. Please note that we are not obligated to respond to inquiries that we receive. You agree that all agreements, notices, disclosures, and other communications that we provide to you electronically satisfy any legal requirement that such communications be in writing.\n\nH. Investigations; Cooperation with Law Enforcement; Termination; Survival. The Company reserves the right, without any limitation, to: (i) investigate any suspected breaches of its security or its information technology or other systems or networks, (ii) investigate any suspected breaches of these TOS, (iii) investigate any information obtained by the Company in accordance with its Privacy Policy in connection with reviewing law enforcement databases or complying with criminal laws, (iv) involve and cooperate with law enforcement authorities in investigating any of the foregoing matters, (v) prosecute violators of these TOS, and (vi) discontinue the Services, in whole or in part, or, except as may be expressly set forth in these TOS, suspend or terminate your access to it, in whole or in part, including any user accounts or registrations, at any time, without notice, for any reason and without any obligation to you or any third party. Any suspension or termination will not affect your obligations to the Company under these TOS. Upon suspension or termination of your access to the Services, or upon notice from the Company, all rights granted to you under these TOS will cease immediately, and you agree that you will immediately discontinue use of the Services. The provisions of these TOS, which by their nature should survive your suspension or termination will survive, including the rights and licenses you grant to the Company in these TOS, as well as the indemnities, releases, disclaimers, and limitations on liability and the provisions regarding jurisdiction, choice of law, no class action, and mandatory arbitration.\n\nI. Assignment. The Company may assign its rights and obligations under these TOS, in whole or in part, to any party at any time without any notice. These TOS may not be assigned by you, and you may not delegate your duties under them, without the prior written consent of an officer of the Company.\n\nJ. No Waiver. Except as expressly set forth in these TOS, (i) no failure or delay by you or the Company in exercising any of rights, powers, or remedies under will operate as a waiver of that or any other right, power, or remedy, and (ii) no waiver or modification of any term of these TOS will be effective unless in writing and signed by the party against whom the waiver or modification is sought to be enforced.\n\nK. Force Majeure. If, by reason of Force Majeure Event (defined below), the Company is delayed or unable, in whole or in part, to perform or comply with any of its obligations under these TOS, then it shall be relieved of liability and shall suffer no prejudice for failing to perform to the extent that the inability was caused by Force Majeure Event. In the event of a Force Majeure Event, the Company shall use commercially reasonable efforts to remedy the situation and remove the cause of its inability to perform. Force Majeure Event means any acts of God, flood, fire or explosion, war, invasion, riot or other civil unrest; embargoes or blockades, national or regional emergency; strikes, labor stoppages or slowdowns or other industrial disturbances, shortage of adequate power or telecommunications or transportation facilities.\n\nL. Entire Agreement. These TOS and any other terms of use relevant to your use of the Services, constitute the entire understanding and agreement between the parties with respect to your use of the Services and supersede any and all prior or contemporaneous oral or written communications, and are intended as a final expression of our agreement.\n\nM. English Version. If the English version of these TOS conflicts with any other language version, the English version shall prevail. \n\n13. Special Provisions.\n\nA. Purchases made by users resident in the EU and UK\n\nThe following provision will apply if you are the resident in the EU or UK to the extent legally permissible.\n\nCancellation Rights for Virtual Items. You acknowledge and agree that any Virtual Items purchased by you on the Services will be available to you immediately, and therefore you agree to waive your statutory right to any withdrawal or cooling off period.\n\nLast updated: 11/20/2023\n\n\n"
        },
        {
            "id": 702101,
            "value": "Close App"
        },
        {
            "id": 702102,
            "value": "In-game overlay is disabled.\n\nTo ensure transactions and data transfers display properly, please enable in-game overlay and restart the game."
        },
        {
            "id": 702103,
            "value": "Display/Hide Control Guide"
        },
        {
            "id": 702104,
            "value": "U. C. Ability"
        },
        {
            "id": 702105,
            "value": "Specify Level"
        },
        {
            "id": 702106,
            "value": "Specify Level/Specify Overboost Tier"
        },
        {
            "id": 702107,
            "value": "Overspeed 1"
        },
        {
            "id": 702108,
            "value": "Overspeed 2"
        },
        {
            "id": 702109,
            "value": "Overspeed 3"
        },
        {
            "id": 702110,
            "value": "Go to Skip Battle screen"
        }
    ]
}