[
    {
        "Id": 101,
        "Name": {
            "Ja": "記憶のはじまり",
            "En": "Memories Anew"
        },
        "Synopsis": {
            "Ja": "故郷での事件のあと、俺は何かに導かれるように\n七番街スラムの駅にたどりついた。そこで、幼な\nじみのティファとまさかの再会を果たした。スラ\nムの生活にすっかりなじんでいるティファと俺の\n空白が再び埋まり始めた。",
            "En": "After what happened to Nibelheim, I found myself at the station in the Sector 7 Slums—almost as if I were guided there. I reunited with Tifa, my childhood friend who had made this place her home, and we quickly began to make up for lost time."
        },
        "CharacterStoryId": 1,
        "PremiseCharacterStorySectionId": 0,
        "FirstClearRewardSetId": 330000000101,
        "DisplayConditionSetId": 0,
        "LockConditionSetId": 0,
        "OrderNo": 1,
        "ResourceId": 1
    },
    {
        "Id": 301,
        "Name": {
            "Ja": "数奇なご縁",
            "En": "A Fated Encounter"
        },
        "Synopsis": {
            "Ja": "故郷での事件で大けがを負った私は、目覚めたら\nスラム街で入院していた。入院費でたくさんの借\n金を抱えてしまった私は、見知らぬミッドガルで\nひとりぼっちの生活が始まった――これは、すべ\nてを失った私が手に入れた大事で大切な記憶。",
            "En": "After suffering a horrific accident, I awoke in a clinic in the Sector 7 Slums. With nothing but a huge hospital bill to my name, I began a new life in Midgar—one that would soon lead me to make great friends and new precious memories."
        },
        "CharacterStoryId": 3,
        "PremiseCharacterStorySectionId": 0,
        "FirstClearRewardSetId": 330000000301,
        "DisplayConditionSetId": 0,
        "LockConditionSetId": 0,
        "OrderNo": 1,
        "ResourceId": 3
    },
    {
        "Id": 401,
        "Name": {
            "Ja": "憧れのピクニック",
            "En": "A Dream Picnic"
        },
        "Synopsis": {
            "Ja": "子どもの頃から憧れていたピクニック。ついにか\nなう日が来た！でも私の楽しみ、いつもあと一歩\nのところでかなわない。スラムで初めての誕生日\n会だって予期せぬお客さんのせいで中止に……。\n今度こそピクニック、行けるかな……？",
            "En": "I've always wanted to go on a picnic since I was little, and today's finally the day! But every time I try to have fun, something always seems to mess it up... Like that time I couldn't go out and celebrate my birthday. Will today be different? Will I finally get to enjoy a long-awaited picnic?"
        },
        "CharacterStoryId": 4,
        "PremiseCharacterStorySectionId": 0,
        "FirstClearRewardSetId": 330000000401,
        "DisplayConditionSetId": 0,
        "LockConditionSetId": 0,
        "OrderNo": 1,
        "ResourceId": 4
    }
]