{
    "data": [
        {
            "id": 130001,
            "value": "<align=\"center\">ユーザー規約</align>\n<align=\"center\">（FINAL FANTASY VII EVER CRISIS）</align>\n\n\nお客様（以下「ユーザー」といいます）による、株式会社スクウェア・エニックス（以下「当社」といいます）が提供する表題記載のサービス（以下「本サービス」といいます）の利用については、このユーザー規約（以下「本規約」といいます）が適用されます。ユーザーは、本サービスの利用にあたり、本規約に加えて、本サービスが提供されるマーケット、ストア等の利用規約（以下「ストア利用規約」といいます）についても遵守してください。\n\nユーザーが未成年の場合：\n    • 保護者の明確な同意を得たうえで、本規約に同意してください。\n    • 本サービスの利用が日常生活に支障をきたすことのないよう、本サービスの利用時間等につき、保護者と相談をして決めてください。\n\n1.  本サービスの利用許諾\n\n本規約に同意することを条件として、当社はユーザーに対して、本サービス（ソースコード及びオブジェクトコードを除きます）を個人的に利用する非独占的な権利を許諾します。\nユーザーは、本サービスの性質上、本サービスが当社の合理的な裁量に基づき変更、中断、利用制限され、また提供が終了することを理解した上で本サービスを利用するものとします。\nなお、本規約以外に、本サービスに関する追加または異なる取引条件を定めるガイドライン、ルール、利用条件、販売条件等（以下「追加規約」といいます）が存在する場合、これらもユーザーによる本サービスの利用に適用されます。本規約と追加規約が矛盾する場合、追加規約が優先して適用されます。ただし、追加規約に本規約が優先されることが明示的に記載されている場合は、この限りではありません。\n\n2.  禁止行為  \n当社は、全ての利用者に楽しい体験をしていただくため、また、当社の知的財産権を守るために、本条に定める行為（以下「禁止行為」といいます）を厳に禁止します。なお禁止行為には、禁止行為の準備行為や禁止行為をほう助したり、そそのかしたりする行為も含まれます。\n当社は、ユーザーが本規約に違反した場合、または禁止行為を行った場合（禁止行為を行ったと当社が信じるに足る合理的な理由がある場合を含みます）、当該違反及び行為の内容に応じ、当社の合理的な裁量により、以下を含む様々な対応を行うことができます。なお、当社はユーザーの行為が禁止行為に該当するか否かを調査する目的で、一時的に以下に定める措置をとる場合があります。\n•  警告\n•  不正に取得したゲーム内アイテムまたは通貨の削除\n•  ゲーム内通貨購入の一時的又は永久的な制限\n•  アカウントの一時的又は永久的な停止\n•  契約違反、著作権侵害その他の理由による法的措置（訴訟、差し止めを含みます）\n\n  2.1  アカウント情報の共有  ユーザーはストア利用規約で許される場合を除き、アカウント情報またはログイン情報を他者と共有しないものとします。\n\n  2.2  阻害行為  ユーザーは、当社のコンピュータ及びサーバーの阻害を含み、当社及び他の利用者による本サービスの利用を阻害しないものとします。阻害行為には、本サービスに関するカスタマーサポート窓口に過度の問い合わせを送るなどして、他の利用者による正当なカスタマーサポートの利用を阻害する行為が含まれます。\n\n  2.3  誹謗中傷  ユーザーは、本サービスの利用において、通常の人間が、攻撃的、わいせつ、過激、その他不適切と考えるであろう表現を用いないものとします。\n\n  2.4  なりすまし  ユーザーはいかなる個人または団体にもなりすましてはならず、また、自身を当社の従業員、代表者その他当社の関係者であるかのように詐称してはならないものとします。ユーザーの安全のために、当社はユーザーが自身のプライバシーに配慮し、匿名性を維持し、他の利用者に対して個人情報を提供しないことを推奨します。 \n\n  2.5  当社及び第三者の名称、知的財産権等の使用  ユーザーは、当社、その他の第三者が有する名称その他の知的財産権（ユーザー名やキャラクター名を有名人、企業、商品または既存のキャラクターの名称にすることを含みます）を本サービスにおいて使用しないものとします。\n\n  2.6  違法行為  ユーザーは、本サービスに関連して違法行為を行わないものとします。違法行為には、著作権侵害、商標権侵害、ギャンブル、中傷、脅迫、詐欺等を含みます。\n\n  2.7  偽の情報の提供  ユーザーは、本サービスの利用にあたり、当社及び本サービスが提供されるマーケット、ストア等に対して偽の情報を提供してはならないものとします。\n\n  2.8  ハラスメント  ユーザーは、本サービスの利用に関連して、他の利用者、当社、その他の第三者に嫌がらせを行ってはならないものとします。\n\n  2.9  チートまたはボットの利用  ユーザーは、チート、ボット、自動ソフトウェア、不正侵入ソフト、モッド、その他本サービスを不正利用する事、また本サービスを改変する事などを目的とするソフト等を制作しまたは利用しないものとします。\n\n  2.10　不具合等の利用　ユーザーは、本サービスのシステムの不具合またはセキュリティー上の弱点を利用しないものとします。また、本サービスの機能等を本来の目的以外の目的で利用しないものとします。\n\n  2.11  リアルマネートレーディング、ファーミング、パワーレベリング等　ユーザーは、本サービスの利用を通じて生成もしくは取得されるすべてのデータ（以下「アカウント等」といい、アカウント、キャラクター、ゲーム内通貨、数値・データ、その他のゲーム内アイテムを含みますが、それらに限られません）を、直接、第三者による仲介、またはインターネットオークション等の手段を問わず、対価（金銭、物品、その他の財産上の利益、本サービス以外のサービス上の通貨、キャラクター、アイテム、ポイント、データ、情報等を含みます。以下、同じ。）と引き換えに、譲渡、譲受、貸与、借用、委任等しないものとします。また、ユーザーは、第三者の代わりにアカウント等を取得したり、ゲームプレイの進行を行ったり、第三者に対価と引き換えにアカウント等を販売する目的で本サービスを利用しないものとします。\n\n  2.12  商用利用  ユーザーは、当社の事前の書面による承諾なく、本サービスを商業的な目的で利用しないものとします。\n\n  2.13  プライベートサーバーの利用  ユーザーは第三者のサーバーに接続して、本サービスと同一または類似のサービスを利用してはならないものとします。 \n\n  2.14  データ収集  ユーザーは、当社が明示的に認めている場合を除き、本サービスから情報を傍受、取り出しまたはその他収集しないものとします。\n\n  2.15  ハッキング及び迂回行為  ユーザーは、いかなる場合も本サービスに関連するサーバー、アプリケーション、データ、コードなどをハッキング、その他改変をしないものとします。\n\n  2.16　解析行為　ユーザーは、当社が許可した場合を除き、いかなる場合も本サービスに関連するサーバー、アプリケーション、データ、コードなどの複製およびリバースエンジニアリング（解析、逆アッセンブル、およびデコンパイルを含みます）をしないものとします。\n\n  2.17  改変または二次著作物の制作  ユーザーは、当社が明示的に許諾する場合を除き、本サービスの構成要素を改変しないものとし、また、本サービスの二次著作物を制作しないものとします。\n\n  2.18  商業スパム/スピムの使用  ユーザーは、本サービスにおいて提供されているチャット、メッセージサービス等の機能を、その目的以外の目的に使用しないものとします。\n\n  2.19　複数アカウント取得 　ユーザーは、当社が明示的に許諾する場合を除き、本サービスにおいて、自己が作成・管理するアカウントを複数所持してはならず、また当該複数アカウントを使用して本サービスを利用しないものとします。\n  2.20　返金申請による利得行為　ユーザーは、本サービスが提供されるマーケット、ストア等が提供する課金サービスにおいて利得することを目的として返金申請を行わないものとします。なお、返金申請が利得目的であるかどうかの判断は、当社の合理的な判断によるものとします。\n\n  2.21　禁止行為に対する当社の措置を迂回する行為　ユーザーは、本サービスに関して、本条違反に基づき当社よりアカウントの停止または終了措置を受けている場合、当該停止または終了を迂回する目的で異なる登録情報を用いて再登録することはできません。\n\n  2.22　不正に入手したアカウント等の利用　ユーザーは、本サービス以外のアプリまたはサービス等を経て入手したアカウント等、または本サービスが提供されるマーケット、ストア等を除く第三者から入手したアカウント等を、本サービスで利用することはできません。\n\n  2.23　その他本サービスの提供に悪影響を及ぼす行為　ユーザーは、前各項に加え、当社が本サービスの提供に悪影響を及ぼすと判断する行為を行わないものとします。\n\n \n3.  権利帰属\n\n当社（該当する場合はそのライセンサーも含む）は、本サービスに関する一切の権利を保有し、それらに関するすべての権利及び権限を将来に渡って有しており、且つ、アカウント等に関する一切の権利（知的財産権を含みます）を有します。当社は、本サービスに内包されるすべてのコンピューターコード、タイトル、テーマ、物体、キャラクター、キャラクターの名称、アニメーション、プロセス、肖像、楽曲とその録音物、ストーリー、環境、建物、美術、音声その他に関する著作権その他の知的財産権のすべてを有します。ユーザーは、本規約で認められている限定的な範囲において本サービスにアクセスし利用する権利のみを付与されています。\n\n4.　アカウント等\n\n  4.1　利用許諾　ユーザーは、本サービスにおいてユーザーのアカウント等を利用する権利のみを許諾されています。ユーザーは、ユーザーのアカウント等を、いかなる目的においても、販売、貸与又は複製することはできません。もしユーザーがこれらの行為を行った場合、本規約に基づく本サービスの利用許諾は直ちに無効となります。ユーザーは、自己が行ったか否かを問わずアカウント等の利用及び管理について一切の責任を負うものとします。\n\n  4.2　管理　ユーザーは、当社がアカウント等を本サービスの提供に必要な範囲で管理、変更、運用する権利を有することを認めます。ユーザーが、アカウント等に関して何らかの詐欺的行為、濫用、若しくは違法な行為を行った又はそのおそれがあると当社が判断した場合、またはユーザーが本規約に違反した又はそのおそれがあると当社が判断した場合、当社は予告なくユーザーのアカウント等を変更、削除または利用不可能とし、もしくはユーザーの本サービスへのアクセスを停止または終了することができます。当社はユーザーまたはいかなる第三者に対してもこの権利の行使について、当社の責めに帰すべき事由がある場合を除き、責任を負いません。\n\n  4.3　不使用による削除　当社は、ユーザーが1年間本サービスを利用していないと判断した場合、ユーザーへ通知をすることなく、またユーザーの承諾を得ることなく、ユーザーのアカウント等を削除する場合があり、ユーザーは予めこれに同意するものとします。ただし、ユーザーが有償で購入したゲーム内通貨については、この限りではありません。\n\n5.  ゲーム内通貨\n\n  5.1  ゲーム内通貨の導入  本サービスでは本サービス内でのみ利用可能な仮想の通貨（以下「ゲーム内通貨」といいます）を採用する場合があります。ゲーム内通貨は、当社が本サービス内で提供する一定のバーチャルな商品またはサービスを取得するために利用することができます。\n\n  5.2  ゲーム内通貨は、アカウント等の一部をなし、当社は、ユーザーにその利用のみを許諾しています。適用法令に異なる定めがある場合を除き、ゲーム内通貨は何らの換価価値を有さず、ユーザーはゲーム内通貨を本規約に従って利用する権利の他、何らの権利も有さず、当社が当社の裁量でゲーム内通貨と交換可能と定めるバーチャルな商品またはサービスを除き、現金、通貨、ライセンスまたは権利等、いかなるものとも交換することはできません。ユーザーはゲーム内通貨をいかなる個人または団体に対して移転することはできず、また、いかなる個人または団体からも受領することはできません。\n\n  5.3  ゲーム内通貨の追加  当社が本サービスにおいてゲーム内通貨を採用した場合、ユーザーは、本サービスが定める支払方法を利用することにより、ユーザーのアカウントにゲーム内通貨を追加することができます。未成年のユーザーが保護者名義のクレジットカード等の支払手段を利用する場合は、当該保護者の明示的な同意を得なければならないものとします。当社は通知なく当社の裁量でいつでもゲーム内通貨の価格を変更する権利を有するものとします。ユーザーは、ゲーム内通貨の追加に要する金額にかかる税金等の支払い責任を負うものとします。\n\n  5.4  ゲーム内通貨に係る制限　ユーザーの安全を確保し、詐欺等による被害を防止することを目的として、当社は本サービスにおいてユーザーに許諾される一回当たりまたは月あたりのゲーム内通貨の数もしくは使用金額に制限を設けることができます。同様に、当社はユーザーがユーザーのアカウント内に保有できるゲーム内通貨等の数に制限を設けることができるものとします。\n\n  5.5  ゲーム内通貨の利用  ユーザーはゲーム内通貨を、当社が本サービス内で提供する一定のバーチャルな商品またはサービスに交換することができます。当社はいつでも当社の裁量により、ユーザーに対して通知することなく個別の商品またはサービスと交換するために必要となるゲーム内通貨の数を変更する権利を留保します。一旦商品またはサービスと交換したゲーム内通貨はユーザーのアカウントから減らされ、再度利用することはできません。また、ユーザーは一度完了した取引（ゲーム内通貨と本サービス内のバーチャルな商品またはサービスとの交換をいいます）を取り消すことはできません。ただし、当社は、不正な取引が確認された場合、当該取引を取り消しまたは無効とする権利を留保します。\n\n  5.6  払い戻し不可  法令により認められる場合を除き、ユーザーはいかなる場合においても未使用のゲーム内通貨について払い戻しを受けることができないものとします。\n\n  5.7　ゲーム内通貨の使用期限及びゲーム内通貨の採用終了  ゲーム内通貨の使用期限はありません。但し、当社が本サービスにおいてゲーム内通貨を採用した場合であっても、当社は、本サービスにおいて継続してゲーム内通貨を採用する義務を負わず、また当社の裁量によりいつでも本サービスにおけるゲーム内通貨の採用を中止することができます。\n\n6.  本サービスの終了　当社は、60日の事前通知をもっていつでも本サービスを終了することができます。\n\n7.  個人情報等の取扱い\n\n  7.1  プライバシー・ポリシー　当社は、当社のプライバシー・ポリシー(http://www.jp.square-enix.com/privacy/)に従い、ユーザーの個人情報を適切に取り扱います。\n\n  7.2  利用状況のモニタリング　ユーザーは、当社がユーザーによる本サービスの利用をモニタリングすることにより、ユーザーによる本サービスの利用をサポートし、ユーザーが本規約を遵守していることを確認できることに同意するものとします。また当社は、前記情報を、本サービスを改善するために利用することができるものとします。\n\n  7.3  政府機関への提出　当社は、召喚状や捜査令状の有無に拘らず、政府の法的執行機関に協力するため、ユーザーのアカウント等、電子的コミュニケーションの履歴、及びその他のデータ（個人情報、電子メール及びチャットログを含む）を当該政府機関へ提出する可能性があり、ユーザーは上記に関し同意するものとします。\n\n8.  リンクサイト及び第三者との取引\n\n  8.1  リンクサイト　本サービスには、第三者のウェブサイト、アプリ、その他の場所（以下「リンクサイト」といいます）へのリンクが含まれている場合があります。当社は、リンクサイトのコンテンツ、運用、ポリシー、取引条件、その他の要素に関するコントロール権を有しておらず、当該リンクサイトを確認する義務を負わず、また、当該リンクサイト及び当該リンクサイトに含まれる第三者のコンテンツ、広告、情報、素材、商品、サービス、その他のアイテムを支持、承認、スポンサーするものではありません。ユーザーがリンクサイトに関連しておこなう行為には、当該リンクサイトの運営者が発行するプライバシー・ポリシー等のポリシー、利用規約等が適用されます。リンクサイトにて提供、アクセス、取得、広告されている商品またはサービスの品質または納入に関する問題、及びリンクサイト内に含まれる情報またはコンテンツの表示、配信、活用を原因とした損害の発生等、ユーザーによるリンクサイトの利用に起因して生じた問題については、ユーザー自らの費用と責任で対応するものとします。\n\n  8.2  第三者との取引　ユーザーが本サービス上、または本サービスを通して（リンクサイトまたは広告上もしくはそれらを経由した場合を含みます）第三者と行う取引は、ユーザーと当該第三者との間の取引です。ユーザーは、当該取引を自らの費用と責任で行うものとします。\n\n9.  一般条項\n\n  9.1  補償  ユーザーは、本サービスの利用、禁止行為への関与、本サービスに関してユーザーが提供、リンク、送信、利用可能とした内容、本規約の違反、他の利用者の権利に対する侵害、その他のユーザーの行為から発生するすべての請求、訴訟、法的措置、費用、弁護士費用を含む裁判費用、経費を、当社、当社のグループ会社、運営会社又はこれらの従業員等に対し補償し、一切の迷惑をかけないものとします。\n\n  9.2  保証の否定  当社はユーザーによる本サービスの利用に関し、本規約で明確に定められている場合を除き、明示及び黙示のいずれにおいても、法令に基づく保証を除き、いかなる保証（商品性、特定の目的への適合性、権利の非侵害に関する黙示の保証を含みますが、これらに限りません）もいたしません。また、本サービスは「現状有姿」で提供され、本規約で明確に定められている以外のいかなる保証もないものとします。当社は、本サービスがユーザーの要望にこたえること、また、本サービスが中断やエラーの発生無く機能することを保証しません。\n\n  9.3  責任の制限  当社、当社のグループ会社、運営会社又はこれらの従業員等は、本規約、本サービス、およびアカウント等に起因又は関連して発生するいかなる損害（特別損害、間接損害、偶発的損害、派生的損害、データ消失、利益損失、機会損失等を含み、法理論のいかんを問いません）についても、当社、当社のグループ会社、運営会社又はこれらの従業員等の責めに帰すべき事由による損害を除き、ユーザーに対して責任を負いません。また、当社、当社のグループ会社、運営会社又はこれらの従業員等がユーザーに対して法的責任を負う場合であっても、その上限額は、ユーザーが本サービスに関して当社に対して直近の1か月に支払った金額を超えないものとします。但し、当該損害が当社、当社のグループ会社、運営会社又はこれらの従業員等の故意又は重過失による場合は、この限りではありません。\n\n  9.4  差止による救済  ユーザーは、いかなる場合においても、差止めによる救済、その他禁止命令、規制、その他当社又は本サービスまたはこれに関連する商品またはサービスの頒布、取引、開発及び実施を妨げる救済を得る権利がないことに同意します。\n\n  9.5  準拠法及び裁判管轄  本規約は、法の抵触のルールを排除したうえで、日本法に準拠し、同法に従って解釈されます。本規約の当事者は、本規約又は本サービスから発生し又は関連するあらゆる訴訟及び法的手続きについて、東京地方裁判所の第一審専属的管轄権に取消し不能の形で服するものとします。前記訴訟においてユーザーが敗訴した場合、係る訴訟に伴って当社、当社のグループ会社、運営会社又はこれらの従業員等に発生した訴訟費用及び合理的な弁護士費用は、ユーザーが負担するものとします。本サービスの提供地域は日本国とし、当社は、本サービスが他の地域において適切、適法又は利用可能であることについて保証をしません。\n\n  9.6  ユーザー間の紛争  ユーザーは、本サービスに関連してユーザーと他の利用者を含む第三者との間で発生した紛争について、自らの費用と責任で対応するものとします。\n\n  9.7  分離可能性  本規約のいずれかの文言又は条項が、適法な管轄権を持つ裁判所によって無効又は強制力を持たないと裁定された場合、かかる文言又は条項は、当該裁判所の当該訴訟における裁定で最大限認められた範囲においてのみ有効且つ強制力を持つと解釈されるものとし、その場合であっても、本規約の他の文言及び条項は、影響を受けることも損なわれることも無く、有効に存続するものとします。\n\n  9.8  権利放棄の否定  当社による、本規約上のあらゆる条件又は条項に関する権利放棄は、それが行為又はそれ以外の手段によるものかは問わず、一つまたは複数の事例であっても、当該条件又は条項に関する更なる又は継続した権利放棄、或いは、本規約の他の条件又は条項に関する権利放棄とは解釈されません。当社、当社のグループ会社、運営会社又はこれらの従業員等のユーザーと接する機会のある者は、本規約上のいかなる条件についても修正又は権利放棄をする法的な権限を当社から与えられておりません。\n\n  9.9  権利譲渡  当社は当社の裁量により、本規約に定める権利義務の全部または一部を、ユーザーを含む利用者への通知をすることなく第三者に譲渡または委任することができるものとします。ユーザーの権利はユーザー本人に帰属するものであり、第三者に譲渡することはできません。\n\n  9.10  完全合意　本規約は、プライバシー・ポリシー及び本サービスの利用に関連するその他の利用規約類と共に、本サービスの利用にあたっての、ユーザーと当社間におけるすべての了解と合意を構成するものであり、本規約に関連する事項につき、口頭又は書面で行われた従前の一切の情報のやりとりに取って代わり、それらすべては本規約に包含されます。\n\n  9.11  本規約の変更  当社は当社の裁量により、いつでも、本規約及び本サービスのいかなる条件も、変更、改訂、追加、補足及び削除する権利を留保しています。当社は当社の裁量により、Eメール、ウェブサイトへ掲載、ポップアップスクリーン又はサービス内通知の方法その他の適切な方法により当該変更をユーザーに通知するものとします。本規約及び本サービスの変更は、当該通知の際に定める適用開始日から適用されるものとします。ユーザーが将来実施される本規約の変更を受容できない場合、ユーザーは、本サービスの利用を終了することにより本規約を解約することができます。\n\n  9.12 サポートセンター.  本サービスについてご質問等がある場合には、本サービスまたは本サービスの公式サイトに記載したサポート窓口までお問い合わせください。\n\n10.  本サービス内のバーチャルな商品及びサービスの扱いについて\n本サービス内のバーチャルな商品のうち、別途「資金決済法に基づく表示」と題するページに前払式支払手段として表示するゲーム内通貨は、「資金決済に関する法律」に基づき前払式支払手段として取扱われます。当該前払式支払手段との交換により入手又は提供されたその他のバーチャルな商品及びサービスは、交換をもってこれにかかる商品・サービスの提供がなされたものとし、前払式支払手段に該当しません。\n\n11.  ユーザー情報の外部送信について　本サービスにおいては、以下の外部サービスを利用しています。これらの外部サービスの提供者、利用目的及び提供されるユーザーの情報は、以下のとおりです。\n\n・Adjust （adjust株式会社）\n提供するユーザーの情報：IDFA、AAID、IDFV\n利用目的：アプリ内ユーザーの行動分析\n\n・AppsFlyer（AppsFlyer Japan株式会社）\n提供するユーザーの情報：①IDFA、AAID、購入履歴、ゲームの進捗情報、②IDFV、OS/ブラウザの種類やバージョン、デバイスの種類および画面サイズ、アプリの利用日時、購入履歴、ゲームの進捗情報、IPアドレス\n利用目的：①カスタマイズされた広告配信、②パフォーマンスの測定\n\n・Firebase（Google LLC）\n提供するユーザーの情報：ユーザーID、OS情報、デバイス名/スペック情報、クラッシュデータ、インスタンスID、UUID\n利用目的：クラッシュの調査・分析、プッシュ通知のため\n\n・ironSource（ironSource Mobile Ltd.）\n提供するユーザーの情報：IDFA、AAID、IPアドレス\n利用目的：カスタマイズされた広告配信およびパフォーマンスの測定\n\n・Unity Ads（Unity Technologies）\n提供するユーザーの情報：IDFA、AAID、IPアドレス\n利用目的：カスタマイズされた広告配信およびパフォーマンスの測定\n\n・Google広告（Google LLC）\n提供するユーザーの情報：IDFA、AAID、IPアドレス\n利用目的：カスタマイズされた広告配信およびパフォーマンスの測定\n\n・Twitter広告（X Corp.）\n提供するユーザーの情報：IDFA・AAID\n利用目的：カスタマイズされた広告配信およびパフォーマンスの測定\n\n・Facebook広告（Meta Platforms, Inc.）\n提供するユーザーの情報：IDFA・AAID\n利用目的：カスタマイズされた広告配信およびパフォーマンスの測定\n\n<align=\"right\">以上</align>\n2023年9月7日　制定"
        },
        {
            "id": 130002,
            "value": "クローズドβテスト\nテスター規約\n（FINAL FANTASY VII EVER CRISIS）\n\nはじめに\n本規約は、以下に定める本ゲームのクローズドβテスト（以下「本テスト」といいます）に参加いただくテスターの皆様に適用されるものです。\n本テストに参加されたテスターの皆様は、本規約に同意されたものとみなさせていただきます。ただし、未成年の方が本テストに参加される場合には、本規約への同意に加え、保護者の同意が必要です。\n本規約に同意いただけない皆様及び保護者の同意を得ていない未成年の方は、本テストに参加することができません。本テストに参加されたことをもって、本規約に適切に同意されたものとみなします。\nなお、未成年の方は、本テストへの参加が日常生活に支障をきたすことのないよう、プレイ時間等について保護者と相談して決めてください。\n\n第1条 定義\n1.  「当社」とは、株式会社スクウェア・エニックスをいいます。\n2.  「本ゲーム」とは、当社が運営・提供する冒頭記載のゲームをいいます。\n3.  「本テスト」とは、本ゲームのβバージョンを用いた、本ゲームの正式サービス版の完成に向けた最終調整のためのテストをいいます。\n4.  「テスター」とは、本テストに参加いただく皆様をいいます。\n5.  「本規約」とは、本テストに参加いただくテスターに適用されるこの「クローズドβテストテスター規約」をいいます。\n6.  「テスターデータ」とは、テスターが本テストに参加することにより当社のサーバー等に蓄積されるデータをいいます。\n\n第2条 本規約の適用・準用\n本テストへの参加にあたっては、本規約が適用されます。テスターは、本テストに参加するにあたり、本規約を遵守するものとします。なお、テスターが当社以外の第三者の提供するサービスに基づき本テストに参加する場合、テスターは、本規約に加えて当該第三者の提供する規約等（本規約とあわせて、以下「本規約等」といいます）についても遵守するものとします。\n\n第3条 テスターの役割・責任等\n1.  テスターは、本テスト参加中に発見した本ゲームにかかるソフトウェアや使用環境に関する不具合等について報告をする等の協力を行うものとします。\n2.  テスターは、本テストに参加するにあたり使用するIDおよびパスワード（該当する場合）を他者に知らせず、使用（共用を含む）させないとともに、その管理について一切の責任を持つものとします。\n3.  テスターは、自己のIDおよびパスワード（該当する場合）により本テスト内で行われた行為については、その行為を自己が行ったか否かにかかわらず、責任を負うものとします。\n\n第4条 守秘義務\nテスターは、本テストにより知り得た本ゲームの仕様、技術に関する情報及び不具合に関する情報を、第三者に開示又は漏洩しないものとします。但し、当社が特定の情報について明示的にその開示を認めた場合に限り、テスターは当社が定める条件に従い当該情報の開示をすることができるものとします。\n\n第5条 禁止行為\n当社は、以下の行為を禁止します。\n(1) テスターが、テスターとして有する権利の全部又は一部を他者に譲渡、貸与又は移転すること、若しくは売買、名義変更、質権その他の担保に供する行為\n(2) 本テストを利用した営業活動及び営利目的若しくはその準備を目的とした本テストへの参加\n(3) その他、本規約等に違反する行為\n\n第6条 情報の取得\n当社は、本テスト期間中、本ゲームの分析及び改善を目的として、ハードウェア、ソフトウェア及びエラーログに関する情報並びにテスターデータを、テスターの個別の承諾を得ることなく、テスターのハードウェアから当社のサーバー等へアップロードできるものとします。\n\n第7条 本テスト期間中の蓄積データ等\nテスターが本テスト期間中に蓄積したテスターデータは、本ゲームの正式サービスのプレイヤーデータとして引き継がれません。\n\n第8条 本テストに関する免責事項・本テストの中断・中止\n1.  本テストは、本ゲームの正式サービス版の完成に向けた最終調整を目的として、開発途中の本ゲームをテストするものです。よって本ゲームは現状有姿で提供され、テスターが本テストに参加したことにより、テスター又はテスターのハードウェア等に、何らかの不具合、損害が発生した場合でも、当社はこれらに対する補償・賠償は一切行わないものとします。テスターは自らの責任で本テストに参加するものとします。\n2.  当社は、当社の都合により本テストを中止又は中断し、又は本テストの期間を変更する場合があります。\n\n第9条 権利帰属\nテスターと当社の間においては、当社が本ゲームに関する一切の権利を保有し、それらに関するすべての権利及び権限を将来に渡って有しており、且つ、テスターデータに関する一切の権利（知的財産権を含みます）を有します。テスターは、本規約等で認められている限定的な範囲において本ゲームにアクセスし利用する権利のみを付与されています。\n\n第10条 個人情報\n本テストの実施にあたり、当社がテスターの個人情報を取得する場合、当社は当該個人情報を当社のプライバシー・ポリシー(http://www.jp.square-enix.com/privacy/)に従い取得、管理するものとします。\n\n第11条 本規約の変更\n当社は、本規約の内容を随時任意に変更することができるものとします。当社は、本規約の改定情報をテスターサイト等に掲載する等の方法でテスターに通知するものとします。\n\n第12条 準拠法\n本規約は、その成立、効力、解釈及び行使を含め、全ての事項について日本国法令に従うものとします。テスターは、本規約又は本テストに関連する紛争について、東京地方裁判所を第一審の専属的合意管轄裁判所とすることに合意するものとします。\n\n2023年6月7日"
        }
    ]
}